{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/Marco/Google Drive/HEC/empi/proj/log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Jun 2015, 12:38:58
{txt}
{com}. use "/Users/Marco/Google Drive/HEC/empi/proj/db.dta", clear
{txt}
{com}. 
. 
. //label list cours_id
. 
. ** drops people 
. ** quantiles
. egen n = count(note), by(cours legal_year)
{txt}
{com}. egen i = rank(note),  by(cours legal_year) field
{txt}
{com}. gen quant = 1-(i-1)/n
{txt}
{com}. drop n i
{txt}
{com}. 
. 
. ** ponderated over all years
. gen ponderated = CR * quant
{txt}
{com}. egen summed = sum(ponderated), by(ID)
{txt}
{com}. gen quant_moyenne = summed/total_CR
{txt}
{com}. drop ponderated summed
{txt}
{com}. 
. 
. *drops
. //drop if total_CR < 120 //fail in first year
. 
. ** ponderated grade average for first year
. gen tmp_ponderated = CR * note if year == 1
{txt}(38640 missing values generated)

{com}. gen tmp_CR = CR if year == 1
{txt}(38640 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen moyenne_1 = tmp_summed/tmp_total_CR
{txt}(81 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. ** ponderated quant average for first year
. gen tmp_ponderated = CR * quant if year == 1
{txt}(38640 missing values generated)

{com}. gen tmp_CR = CR if year == 1
{txt}(38640 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_1 = tmp_summed/tmp_total_CR
{txt}(81 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * quant if year == 2
{txt}(38785 missing values generated)

{com}. gen tmp_CR = CR if year == 2
{txt}(38785 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_2 = tmp_summed/tmp_total_CR
{txt}(3433 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * quant if year == 3
{txt}(45156 missing values generated)

{com}. gen tmp_CR = CR if year == 3
{txt}(45156 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_3 = tmp_summed/tmp_total_CR
{txt}(18163 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. //diff between course result and current year avg
. gen delta = .
{txt}(61290 missing values generated)

{com}. replace delta = quant - quant_1 if year == 1 
{txt}(22650 real changes made)

{com}. replace delta = quant - quant_2 if year == 2 
{txt}(22505 real changes made)

{com}. replace delta = quant - quant_3 if year == 3 
{txt}(16134 real changes made)

{com}. 
. 
. 
. ** PASTE GROUPS
. gen tmp_ponderated = CR * delta if sci == 0 & year == 1
{txt}(55661 missing values generated)

{com}. gen tmp_CR = CR if sci == 0 & year == 1
{txt}(55661 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_OTH1 = tmp_summed/tmp_total_CR
{txt}(158 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 1 & year == 1
{txt}(47857 missing values generated)

{com}. gen tmp_CR = CR if sci == 1 & year == 1
{txt}(47857 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_SCI1 = tmp_summed/tmp_total_CR
{txt}(98 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 2 & year == 1
{txt}(57702 missing values generated)

{com}. gen tmp_CR = CR if sci == 2 & year == 1
{txt}(57702 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_MIX1 = tmp_summed/tmp_total_CR
{txt}(132 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if (sci == 0 | sci==2) & year == 1
{txt}(52073 missing values generated)

{com}. gen tmp_CR = CR if (sci == 0 | sci==2) & year == 1
{txt}(52073 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_NONSCI1 = tmp_summed/tmp_total_CR
{txt}(125 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 0 & year == 2
{txt}(54950 missing values generated)

{com}. gen tmp_CR = CR if sci == 0 & year == 2
{txt}(54950 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_OTH2 = tmp_summed/tmp_total_CR
{txt}(8816 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 1 & year == 2
{txt}(48103 missing values generated)

{com}. gen tmp_CR = CR if sci == 1 & year == 2
{txt}(48103 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_SCI2 = tmp_summed/tmp_total_CR
{txt}(3522 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 2 & year == 2
{txt}(58312 missing values generated)

{com}. gen tmp_CR = CR if sci == 2 & year == 2
{txt}(58312 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_MIX2 = tmp_summed/tmp_total_CR
{txt}(8997 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 0 & year != 1
{txt}(44479 missing values generated)

{com}. gen tmp_CR = CR if sci == 0 & year != 1
{txt}(44479 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_OTH23 = tmp_summed/tmp_total_CR
{txt}(8816 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 1 & year != 1
{txt}(43559 missing values generated)

{com}. gen tmp_CR = CR if sci == 1 & year != 1
{txt}(43559 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_SCI23 = tmp_summed/tmp_total_CR
{txt}(3522 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if sci == 2 & year != 1
{txt}(57193 missing values generated)

{com}. gen tmp_CR = CR if sci == 2 & year != 1
{txt}(57192 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_MIX23 = tmp_summed/tmp_total_CR
{txt}(8997 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if year == 2
{txt}(38785 missing values generated)

{com}. gen tmp_CR = CR if year == 2
{txt}(38785 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_2 = tmp_summed/tmp_total_CR
{txt}(3433 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if year == 3
{txt}(45156 missing values generated)

{com}. gen tmp_CR = CR if year == 3
{txt}(45156 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_3 = tmp_summed/tmp_total_CR
{txt}(18163 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * delta if year == 2 | year == 3
{txt}(22651 missing values generated)

{com}. gen tmp_CR = CR if year == 2 | year == 3
{txt}(22651 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen delta_23 = tmp_summed/tmp_total_CR
{txt}(3433 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * note if year == 2
{txt}(38785 missing values generated)

{com}. gen tmp_CR = CR if year == 2
{txt}(38785 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen moyenne_2 = tmp_summed/tmp_total_CR
{txt}(3433 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * note if year == 3
{txt}(45156 missing values generated)

{com}. gen tmp_CR = CR if year == 3
{txt}(45156 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen moyenne_3 = tmp_summed/tmp_total_CR
{txt}(18163 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * note if year == 2 | year == 3
{txt}(22651 missing values generated)

{com}. gen tmp_CR = CR if year == 2 | year == 3
{txt}(22651 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen moyenne_23 = tmp_summed/tmp_total_CR
{txt}(3433 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * quant if year == 2 | year == 3
{txt}(22651 missing values generated)

{com}. gen tmp_CR = CR if year == 2 | year == 3
{txt}(22651 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_23 = tmp_summed/tmp_total_CR
{txt}(3433 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * quant if sci == 0 & year != 1
{txt}(44479 missing values generated)

{com}. gen tmp_CR = CR if sci == 0 & year != 1
{txt}(44479 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_OTH23 = tmp_summed/tmp_total_CR
{txt}(8816 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * quant if sci == 1 & year != 1
{txt}(43559 missing values generated)

{com}. gen tmp_CR = CR if sci == 1 & year != 1
{txt}(43559 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_SCI23 = tmp_summed/tmp_total_CR
{txt}(3522 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. 
. gen tmp_ponderated = CR * quant if sci == 2 & year != 1
{txt}(57192 missing values generated)

{com}. gen tmp_CR = CR if sci == 2 & year != 1
{txt}(57192 missing values generated)

{com}. egen tmp_total_CR = sum(tmp_CR) , by(ID)
{txt}
{com}. egen tmp_summed = sum(tmp_ponderated), by(ID)
{txt}
{com}. gen quant_MIX23 = tmp_summed/tmp_total_CR
{txt}(8997 missing values generated)

{com}. drop tmp_ponderated tmp_CR tmp_total_CR tmp_summed
{txt}
{com}. ** END PASTE
. 
. ** dummies
. 
. **tmp
. global tmp "etat"
{txt}
{com}. rename $tmp tmp
{res}{txt}
{com}. encode tmp, gen($tmp)
{txt}
{com}. drop tmp
{txt}
{com}. 
. ** BSc
. global tmp "BSc"
{txt}
{com}. rename $tmp tmp
{res}{txt}
{com}. encode tmp, gen($tmp)
{txt}
{com}. drop tmp
{txt}
{com}. 
. ** MSc
. global tmp "MSc"
{txt}
{com}. rename $tmp tmp
{res}{txt}
{com}. encode tmp, gen($tmp)
{txt}
{com}. drop tmp
{txt}
{com}. 
. 
. ** matu_lieu
. global tmp "matu_lieu"
{txt}
{com}. rename $tmp tmp
{res}{txt}
{com}. encode tmp, gen($tmp)
{txt}
{com}. drop tmp
{txt}
{com}. 
. // put every underrepresented group in 0 (others)
. by ID, sort: gen nvals = _n == 1 
{txt}
{com}. egen count = sum(nvals), by($tmp)
{txt}
{com}. replace $tmp = 0 if count < 20
{txt}(3555 real changes made)

{com}. drop nvals count
{txt}
{com}. 
. ** matu_ecole
. global tmp "matu_ecole"
{txt}
{com}. rename $tmp tmp
{res}{txt}
{com}. encode tmp, gen($tmp)
{txt}
{com}. drop tmp
{txt}
{com}. 
. // put every underrepresented group in 0 (others)
. by ID, sort: gen nvals = _n == 1 
{txt}
{com}. egen count = sum(nvals), by($tmp)
{txt}
{com}. replace $tmp = 0 if count < 20
{txt}(12218 real changes made)

{com}. drop nvals count
{txt}
{com}. 
. 
. ** matu_nom
. global tmp "matu_nom"
{txt}
{com}. rename $tmp tmp
{res}{txt}
{com}. encode tmp, gen($tmp)
{txt}
{com}. drop tmp
{txt}
{com}. 
. // put every underrepresented group in 0 (others)
. by ID, sort: gen nvals = _n == 1 
{txt}
{com}. egen count = sum(nvals), by($tmp)
{txt}
{com}. replace $tmp = 0 if count < 20
{txt}(3924 real changes made)

{com}. drop nvals count
{txt}
{com}. 
. 
. preserve
{txt}
{com}.         ds(ID), not
{txt}{col 1}debut{col 15}legal_year{col 29}year{col 43}quant_1{col 57}delta_SCI1{col 71}delta_MIX2{col 85}delta_3{col 99}quant_23{col 113}BSc
{col 1}fin{col 15}sexe{col 29}canton{col 43}quant_2{col 57}delta_MIX1{col 71}delta_OTH23{col 85}delta_23{col 99}quant_OTH23{col 113}MSc
{col 1}cours{col 15}total_CR{col 29}quant{col 43}quant_3{col 57}delta_NONS~1{col 71}delta_SCI23{col 85}moyenne_2{col 99}quant_SCI23{col 113}matu_lieu
{col 1}CR{col 15}moyenne{col 29}quant_moye~e{col 43}delta{col 57}delta_OTH2{col 71}delta_MIX23{col 85}moyenne_3{col 99}quant_MIX23{col 113}matu_ecole
{col 1}note{col 15}sci{col 29}moyenne_1{col 43}delta_OTH1{col 57}delta_SCI2{col 71}delta_2{col 85}moyenne_23{col 99}etat{col 113}matu_nom

{com}.         collapse (first) `r(varlist)', by(ID)
{txt}
{com}.         
.         
.         tab2 sexe debut

{res}-> tabulation of sexe by debut  

   {txt}(first) {c |}                                           (first) debut
      sexe {c |}      2006       2007       2008       2009       2010       2011       2012       2013       2014 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         1 {c |}{res}        38         98        100        161        185        160         79         40          7 {txt}{c |}{res}       868 
{txt}         2 {c |}{res}        69        157        225        307        355        266        141         64          8 {txt}{c |}{res}     1,592 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}       107        255        325        468        540        426        220        104         15 {txt}{c |}{res}     2,460 

{txt}
{com}.         tab2 sexe debut if etat != 3

{res}-> tabulation of sexe by debut if etat != 3 

   {txt}(first) {c |}                                           (first) debut
      sexe {c |}      2006       2007       2008       2009       2010       2011       2012       2013       2014 {c |}     Total
{hline 11}{c +}{hline 99}{c +}{hline 10}
         1 {c |}{res}         3          5         25         69         79         75         79         40          7 {txt}{c |}{res}       382 
{txt}         2 {c |}{res}         0          2         31        111        141        129        141         64          8 {txt}{c |}{res}       627 
{txt}{hline 11}{c +}{hline 99}{c +}{hline 10}
     Total {c |}{res}         3          7         56        180        220        204        220        104         15 {txt}{c |}{res}     1,009 

{txt}
{com}. 
.         latabstat moyenne_1 moyenne_2 moyenne_3 moyenne, by(debut) s(mean sd) long

{txt}\begin{c -(}table{c )-}[htbp]\centering
\caption{c -(}\label{c -(}{c )-} 
\textbf{c -(}{c )-} {c )-}\begin{c -(}tabular{c )-} {c -(}@{c -(}{c )-} l r r r r @{c -(}{c )-}{c )-} \\ \hline
\textbf{c -(}debut       stats {c )-} & \textbf{c -(}  moyenn~1{c )-} & \textbf{c -(}  moyenn~2{c )-} & \textbf{c -(}  moyen~_3{c )-} & \textbf{c -(}   moyenne{c )-} \\
\hline
{res}2006         mean  &   4.501402 &   4.279907 &   4.645573 &   4.445414 \\
               sd  &   .2809568 &   .2589845 &    .375799 &   .2272078 \\
2007         mean  &   4.656693 &   4.395773 &   4.731806 &   4.580176 \\
               sd  &   .4055913 &   .3679294 &   .4037419 &   .3494174 \\
2008         mean  &   4.467636 &    4.44772 &   4.729236 &    4.45977 \\
               sd  &   .5248893 &    .401483 &   .3866541 &   .4894625 \\
2009         mean  &   3.942467 &    4.40179 &     4.7692 &   3.967276 \\
               sd  &   .9465355 &   .5682065 &   .4055311 &   .9260684 \\
2010         mean  &   3.890507 &   4.190239 &   4.736133 &   3.927183 \\
               sd  &   .9483145 &   .8016987 &   .4191381 &   .9659944 \\
2011         mean  &   3.900892 &   4.067337 &   4.782489 &   3.905968 \\
               sd  &   .9604512 &    .964434 &    .411499 &   .9663516 \\
2012         mean  &   3.066211 &   2.560022 &          . &    3.03406 \\
               sd  &   .7010399 &   .9965333 &          . &   .6963755 \\
2013         mean  &   2.817063 &   2.565217 &          . &   2.801102 \\
               sd  &   .7278487 &   .9345747 &          . &   .7215713 \\
2014         mean  &   2.974286 &   3.346154 &          . &   3.008039 \\
               sd  &   .6854618 &   .6887372 &          . &   .6485544 \\
Total        mean  &   3.959048 &   4.114521 &   4.740324 &   3.958644 \\
               sd  &   .9401786 &   .8787889 &   .4042057 &   .9303458 \\
{txt}\hline
\multicolumn{c -(}5{c )-}{c -(}@{c -(}{c )-}l{c )-}{c -(}
\footnotesize{c -(}\emph{c -(}Source:{c )-} {c )-}{c )-}
\end{c -(}tabular{c )-}
\end{c -(}table{c )-}

{com}.         latabstat moyenne_1 moyenne_2 moyenne_3 moyenne if etat !=3, by(debut) s(mean sd) long

{txt}\begin{c -(}table{c )-}[htbp]\centering
\caption{c -(}\label{c -(}{c )-} 
\textbf{c -(}{c )-} {c )-}\begin{c -(}tabular{c )-} {c -(}@{c -(}{c )-} l r r r r @{c -(}{c )-}{c )-} \\ \hline
\textbf{c -(}debut       stats {c )-} & \textbf{c -(}  moyenn~1{c )-} & \textbf{c -(}  moyenn~2{c )-} & \textbf{c -(}  moyen~_3{c )-} & \textbf{c -(}   moyenne{c )-} \\
\hline
{res}2006         mean  &   4.191667 &   3.683333 &          . &        3.9 \\
               sd  &   .1127314 &   .1626601 &          . &   .1305038 \\
2007         mean  &       4.35 &   3.860714 &          . &    4.12381 \\
               sd  &   .2236068 &   .1398341 &          . &   .1384796 \\
2008         mean  &   3.830003 &     3.6325 &          . &   3.794568 \\
               sd  &   .5310385 &   .5133023 &          . &   .5081951 \\
2009         mean  &   3.006446 &   3.472987 &   3.227273 &   3.000671 \\
               sd  &   .6910325 &   .8823782 &          . &   .6798109 \\
2010         mean  &   2.995184 &   3.172762 &          . &   2.981994 \\
               sd  &   .7931328 &   .9667299 &          . &   .7818877 \\
2011         mean  &   3.118651 &   2.999986 &          . &   3.090132 \\
               sd  &   .7616749 &   .9509751 &          . &   .7387486 \\
2012         mean  &   3.066211 &   2.560022 &          . &    3.03406 \\
               sd  &   .7010399 &   .9965333 &          . &   .6963755 \\
2013         mean  &   2.817063 &   2.565217 &          . &   2.801102 \\
               sd  &   .7278487 &   .9345747 &          . &   .7215713 \\
2014         mean  &   2.974286 &   3.346154 &          . &   3.008039 \\
               sd  &   .6854618 &   .6887372 &          . &   .6485544 \\
Total        mean  &   3.078262 &   2.945794 &   3.227273 &   3.056033 \\
               sd  &   .7601009 &    .996804 &          . &   .7433736 \\
{txt}\hline
\multicolumn{c -(}5{c )-}{c -(}@{c -(}{c )-}l{c )-}{c -(}
\footnotesize{c -(}\emph{c -(}Source:{c )-} {c )-}{c )-}
\end{c -(}tabular{c )-}
\end{c -(}table{c )-}

{com}.         latabstat moyenne_1 moyenne_2 moyenne_3 moyenne if etat ==3, by(debut) s(mean sd) long

{txt}\begin{c -(}table{c )-}[htbp]\centering
\caption{c -(}\label{c -(}{c )-} 
\textbf{c -(}{c )-} {c )-}\begin{c -(}tabular{c )-} {c -(}@{c -(}{c )-} l r r r r @{c -(}{c )-}{c )-} \\ \hline
\textbf{c -(}debut       stats {c )-} & \textbf{c -(}  moyenn~1{c )-} & \textbf{c -(}  moyenn~2{c )-} & \textbf{c -(}  moyen~_3{c )-} & \textbf{c -(}   moyenne{c )-} \\
\hline
{res}2006         mean  &   4.510337 &   4.297115 &   4.645573 &   4.461147 \\
               sd  &   .2794892 &   .2405156 &    .375799 &   .2094803 \\
2007         mean  &   4.665385 &   4.410876 &   4.731806 &   4.593057 \\
               sd  &   .4064646 &   .3610971 &   .4037419 &   .3449896 \\
2008         mean  &   4.601372 &   4.478026 &   4.729236 &   4.598251 \\
               sd  &    .414312 &   .3641911 &   .3866541 &   .3534436 \\
2009         mean  &   4.527479 &   4.527566 &   4.776948 &   4.571404 \\
               sd  &   .5168007 &   .3613039 &   .3914307 &   .3937089 \\
2010         mean  &   4.506042 &   4.511381 &   4.736133 &   4.577001 \\
               sd  &   .3933755 &   .3493058 &   .4191381 &   .3424582 \\
2011         mean  &   4.619707 &   4.581781 &   4.782489 &   4.655655 \\
               sd  &   .3964997 &   .3595548 &    .411499 &   .3399634 \\
Total        mean  &     4.5728 &   4.486645 &   4.741692 &   4.586304 \\
               sd  &    .424179 &   .3586725 &   .4018165 &   .3500494 \\
{txt}\hline
\multicolumn{c -(}5{c )-}{c -(}@{c -(}{c )-}l{c )-}{c -(}
\footnotesize{c -(}\emph{c -(}Source:{c )-} {c )-}{c )-}
\end{c -(}tabular{c )-}
\end{c -(}table{c )-}

{com}.         
. 
. 
.         reg quant_SCI23 delta_SCI1 delta_MIX1, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F(  2,  1893) ={res}   24.91
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0210
                                                       {txt}Root MSE      = {res} .22041

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} quant_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .7997318{col 26}{space 2} .1227416{col 37}{space 1}    6.52{col 46}{space 3}0.000{col 54}{space 4} .5590089{col 67}{space 3} 1.040455
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .2253392{col 26}{space 2} .0346852{col 37}{space 1}    6.50{col 46}{space 3}0.000{col 54}{space 4}  .157314{col 67}{space 3} .2933644
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5727891{col 26}{space 2}  .005064{col 37}{space 1}  113.11{col 46}{space 3}0.000{col 54}{space 4} .5628575{col 67}{space 3} .5827207
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         reg quant_SCI23 delta_OTH1 delta_MIX1, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F(  2,  1893) ={res}   27.23
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0218
                                                       {txt}Root MSE      = {res} .22032

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} quant_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.1820174{col 26}{space 2} .0264097{col 37}{space 1}   -6.89{col 46}{space 3}0.000{col 54}{space 4}-.2338126{col 67}{space 3}-.1302222
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .0480408{col 26}{space 2} .0249466{col 37}{space 1}    1.93{col 46}{space 3}0.054{col 54}{space 4}-.0008849{col 67}{space 3} .0969665
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5730545{col 26}{space 2} .0050628{col 37}{space 1}  113.19{col 46}{space 3}0.000{col 54}{space 4} .5631253{col 67}{space 3} .5829836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         
.         reg quant_MIX23 delta_SCI1 delta_MIX1, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  2,  1482) ={res}   26.47
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0326
                                                       {txt}Root MSE      = {res} .21814

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} quant_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .4096795{col 26}{space 2}  .147044{col 37}{space 1}    2.79{col 46}{space 3}0.005{col 54}{space 4} .1212429{col 67}{space 3} .6981161
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}  .291682{col 26}{space 2} .0427322{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4}   .20786{col 67}{space 3}  .375504
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6025455{col 26}{space 2}  .005666{col 37}{space 1}  106.34{col 46}{space 3}0.000{col 54}{space 4} .5914314{col 67}{space 3} .6136597
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         reg quant_MIX23 delta_OTH1 delta_MIX1, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  2,  1482) ={res}   27.15
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0332
                                                       {txt}Root MSE      = {res} .21807

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} quant_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.0946027{col 26}{space 2} .0320127{col 37}{space 1}   -2.96{col 46}{space 3}0.003{col 54}{space 4}-.1573977{col 67}{space 3}-.0318077
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .2017476{col 26}{space 2} .0315337{col 37}{space 1}    6.40{col 46}{space 3}0.000{col 54}{space 4}  .139892{col 67}{space 3} .2636031
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6026695{col 26}{space 2} .0056628{col 37}{space 1}  106.43{col 46}{space 3}0.000{col 54}{space 4} .5915615{col 67}{space 3} .6137775
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         
.         reg quant_OTH23 delta_SCI1 delta_MIX1, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F(  2,  1501) ={res}   24.72
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0294
                                                       {txt}Root MSE      = {res} .15897

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} quant_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.7324463{col 26}{space 2}  .104957{col 37}{space 1}   -6.98{col 46}{space 3}0.000{col 54}{space 4}-.9383243{col 67}{space 3}-.5265684
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.1656667{col 26}{space 2} .0303335{col 37}{space 1}   -5.46{col 46}{space 3}0.000{col 54}{space 4}-.2251673{col 67}{space 3} -.106166
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6476796{col 26}{space 2} .0040946{col 37}{space 1}  158.18{col 46}{space 3}0.000{col 54}{space 4} .6396479{col 67}{space 3} .6557113
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         reg quant_OTH23 delta_OTH1 delta_MIX1, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F(  2,  1501) ={res}   23.68
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0286
                                                       {txt}Root MSE      = {res} .15903

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} quant_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2} .1571825{col 26}{space 2} .0230134{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} .1120405{col 67}{space 3} .2023244
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.0055371{col 26}{space 2}  .021971{col 37}{space 1}   -0.25{col 46}{space 3}0.801{col 54}{space 4}-.0486342{col 67}{space 3}   .03756
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6474714{col 26}{space 2} .0040971{col 37}{space 1}  158.03{col 46}{space 3}0.000{col 54}{space 4} .6394348{col 67}{space 3}  .655508
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
.         gsort -moyenne
{txt}
{com}.         
.         
.         ** plot **
.         replace etat = 2 if etat == 1
{txt}(558 real changes made)

{com}.         collapse (mean) moyenne (sem) se = moyenne, by(debut etat)
{txt}
{com}.                 gen plus = moyenne + 1.96*se
{txt}
{com}.                 gen minus = moyenne - 1.96*se
{txt}
{com}.                 twoway ///
>                 (line moyenne debut if etat==2,sort lwidth(thick) lcolor("0 153 153")) ///
>                 (line moyenne debut if etat==3, sort lwidth(thick) lcolor("153 0 0")) ///
>                 (rcap plus minus debut, color(black)) ///
>                 , scheme(s2color) legend(order(1 "Failed" 2 "Graduated")) ///
>                 xtitle("Beginning year") ytitle("GPA")
{res}{txt}
{com}.                 graph export "moyenne.eps", replace
{txt}(file moyenne.eps written in EPS format)

{com}. restore
{txt}
{com}. 
. ** graphs **
. 
. hist delta, saving(g0, replace)
{txt}(bin={res}47{txt}, start={res}-.86022729{txt}, width={res}.03570919{txt})
{res}{txt}(file g0.gph saved)

{com}. hist delta_SCI1, saving(g1, replace)
{txt}(bin={res}47{txt}, start={res}-.20576359{txt}, width={res}.01110396{txt})
{res}{txt}(file g1.gph saved)

{com}. hist delta_MIX1, saving(g2, replace)
{txt}(bin={res}47{txt}, start={res}-.66973978{txt}, width={res}.0270532{txt})
{res}{txt}(file g2.gph saved)

{com}. hist delta_OTH1, saving(g3, replace)
{txt}(bin={res}47{txt}, start={res}-.60329485{txt}, width={res}.02847413{txt})
{res}{txt}(file g3.gph saved)

{com}. graph combine g0.gph g1.gph g2.gph g3.gph
{res}{txt}
{com}. graph export "deltas.eps", replace
{txt}(file deltas.eps written in EPS format)

{com}. latabstat delta delta_SCI1 delta_MIX1 delta_OTH1, by(debut) s(mean sd) long

{txt}\begin{c -(}table{c )-}[htbp]\centering
\caption{c -(}\label{c -(}{c )-} 
\textbf{c -(}{c )-} {c )-}\begin{c -(}tabular{c )-} {c -(}@{c -(}{c )-} l r r r r @{c -(}{c )-}{c )-} \\ \hline
\textbf{c -(}debut       stats {c )-} & \textbf{c -(}     delta{c )-} & \textbf{c -(}  de~_SCI1{c )-} & \textbf{c -(}  delta~X1{c )-} & \textbf{c -(}  delta~H1{c )-} \\
\hline
{res}2006         mean  &  -.0010201 &   .0024821 &  -.0066845 &  -.0056984 \\
               sd  &   .2549929 &   .0595867 &   .2248986 &   .2106151 \\
2007         mean  &  -.0002217 &   .0033251 &  -.0123725 &  -.0027931 \\
               sd  &   .2473213 &   .0613527 &   .2276017 &   .2038183 \\
2008         mean  &   .0030124 &  -.0043152 &  -.0088202 &   .0274503 \\
               sd  &   .2359713 &   .0615961 &    .212184 &   .1919601 \\
2009         mean  &   .0087136 &  -.0024599 &  -.0028229 &   .0203145 \\
               sd  &   .2219427 &   .0399081 &     .13132 &   .1530087 \\
2010         mean  &   .0014787 &  -.0021758 &   .0145661 &   .0007911 \\
               sd  &   .2264081 &   .0466623 &    .139706 &   .1600304 \\
2011         mean  &  -.0002945 &  -.0014327 &   .0112612 &   -.004182 \\
               sd  &   .2175955 &   .0471209 &   .1463528 &   .1492725 \\
2012         mean  &   .0035528 &  -.0053011 &  -.0029394 &   .0291159 \\
               sd  &   .2043771 &   .0543845 &   .1486076 &   .1844625 \\
2013         mean  &   .0053406 &  -.0074005 &  -.0127259 &   .0471383 \\
               sd  &   .2135919 &   .0563327 &   .1876084 &    .191214 \\
2014         mean  &  -.0032677 &   .0040687 &  -.0318605 &  -.0064318 \\
               sd  &   .1876941 &   .0792771 &   .2254533 &   .2605538 \\
Total        mean  &    .002515 &  -.0016027 &   .0011797 &    .008531 \\
               sd  &   .2292595 &   .0516892 &   .1730637 &   .1740549 \\
{txt}\hline
\multicolumn{c -(}5{c )-}{c -(}@{c -(}{c )-}l{c )-}{c -(}
\footnotesize{c -(}\emph{c -(}Source:{c )-} /Users/Marco/Google Drive/HEC/empi/proj/db.dta{c )-}{c )-}
\end{c -(}tabular{c )-}
\end{c -(}table{c )-}

{com}. 
. corrtex delta_OTH1 delta_OTH23 delta_SCI1 delta_SCI23 delta_MIX1 delta_MIX23, file(correlation.tex) replace


{res}\begin{c -(}table{c )-}[htbp]\centering \caption{c -(}Cross-correlation table\label{c -(}corrtable{c )-}{c )-}
\begin{c -(}tabular{c )-}{c -(}l  c  c  c  c  c  c {c )-}\hline\hline
\multicolumn{c -(}1{c )-}{c -(}c{c )-}{c -(}Variables{c )-} &delta\_OTH1&delta\_OTH23&delta\_SCI1&delta\_SCI23&delta\_MIX1&delta\_MIX23\\ \hline
delta\_OTH1&1.000\\
delta\_OTH23&0.300&1.000\\
delta\_SCI1&-0.669&-0.184&1.000\\
delta\_SCI23&-0.273&-0.812&0.218&1.000\\
delta\_MIX1&-0.069&-0.042&-0.685&-0.030&1.000\\
delta\_MIX23&-0.095&-0.313&-0.072&-0.080&0.184&1.000\\
\hline \hline 
 \end{c -(}tabular{c )-}
\end{c -(}table{c )-}

 Output writted successfully in file : {txt}correlation.tex

{com}.  
.  
. encode(cours), gen(cours_id)
{txt}
{com}. 
. ** tables **
. 
. * by cours
. preserve
{txt}
{com}. 
.         drop cours CR legal_year sci year
{txt}
{com}.         reshape wide note delta quant, i(ID) j(cours_id)
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   61290   {txt}->{res}    2460
{txt}Number of variables            {res}      42   {txt}->{res}     593
{txt}j variable (185 values)        {res}cours_id   {txt}->   (dropped)
xij variables:
                                   {res}note   {txt}->   {res}note1 note2 ... note185
                                  delta   {txt}->   {res}delta1 delta2 ... delta185
                                  quant   {txt}->   {res}quant1 quant2 ... quant185
{txt}{hline 77}

{com}.         gen fini = etat == 3
{txt}
{com}.         gen vieuxCours = debut <= 2010
{txt}
{com}. 
.         global y = "delta_SCI23"
{txt}
{com}.         global x "delta_SCI1 delta_MIX1"
{txt}
{com}.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F( 10,  1885) ={res}   16.43
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0793
                                                       {txt}Root MSE      = {res} .05093

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .3390453{col 26}{space 2} .0324396{col 37}{space 1}   10.45{col 46}{space 3}0.000{col 54}{space 4} .2754241{col 67}{space 3} .4026665
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .0596424{col 26}{space 2} .0102337{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} .0395717{col 67}{space 3}  .079713
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0092043{col 26}{space 2} .0024571{col 37}{space 1}    3.75{col 46}{space 3}0.000{col 54}{space 4} .0043854{col 67}{space 3} .0140232
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0112586{col 26}{space 2} .0063111{col 37}{space 1}   -1.78{col 46}{space 3}0.075{col 54}{space 4}-.0236362{col 67}{space 3} .0011189
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0039836{col 26}{space 2}  .004483{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-.0127758{col 67}{space 3} .0048086
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}  .003831{col 26}{space 2} .0040295{col 37}{space 1}    0.95{col 46}{space 3}0.342{col 54}{space 4}-.0040718{col 67}{space 3} .0117338
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0001498{col 26}{space 2} .0039852{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-.0079657{col 67}{space 3}  .007666
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0080378{col 26}{space 2} .0033143{col 37}{space 1}    2.43{col 46}{space 3}0.015{col 54}{space 4} .0015376{col 67}{space 3}  .014538
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0115429{col 26}{space 2} .0027842{col 37}{space 1}    4.15{col 46}{space 3}0.000{col 54}{space 4} .0060824{col 67}{space 3} .0170034
{txt}{space 7}2013  {c |}{col 14}{res}{space 2} .0140223{col 26}{space 2}  .003131{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} .0078818{col 67}{space 3} .0201629
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0153028{col 26}{space 2}  .002786{col 37}{space 1}   -5.49{col 46}{space 3}0.000{col 54}{space 4}-.0207669{col 67}{space 3}-.0098388
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using sci23, label replace dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"sci23.tex"'"':sci23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "sci23.txt", label"':seeout}

{com}.         global x "delta_OTH1 delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F( 10,  1885) ={res}   16.71
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0816
                                                       {txt}Root MSE      = {res} .05086

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.0769643{col 26}{space 2} .0073295{col 37}{space 1}  -10.50{col 46}{space 3}0.000{col 54}{space 4} -.091339{col 67}{space 3}-.0625896
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} -.015527{col 26}{space 2} .0074272{col 37}{space 1}   -2.09{col 46}{space 3}0.037{col 54}{space 4}-.0300934{col 67}{space 3}-.0009606
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}  .009106{col 26}{space 2} .0024537{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .0042938{col 67}{space 3} .0139183
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0116263{col 26}{space 2} .0063046{col 37}{space 1}   -1.84{col 46}{space 3}0.065{col 54}{space 4} -.023991{col 67}{space 3} .0007383
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0042416{col 26}{space 2} .0044773{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}-.0130225{col 67}{space 3} .0045393
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0035813{col 26}{space 2} .0040319{col 37}{space 1}    0.89{col 46}{space 3}0.375{col 54}{space 4}-.0043262{col 67}{space 3} .0114889
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}  .000082{col 26}{space 2} .0039829{col 37}{space 1}    0.02{col 46}{space 3}0.984{col 54}{space 4}-.0077294{col 67}{space 3} .0078934
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}  .007798{col 26}{space 2} .0033079{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4} .0013105{col 67}{space 3} .0142855
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0113611{col 26}{space 2} .0027188{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .0060289{col 67}{space 3} .0166933
{txt}{space 7}2013  {c |}{col 14}{res}{space 2} .0136447{col 26}{space 2} .0030427{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} .0076774{col 67}{space 3} .0196121
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0150115{col 26}{space 2}  .002782{col 37}{space 1}   -5.40{col 46}{space 3}0.000{col 54}{space 4}-.0204677{col 67}{space 3}-.0095553
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using sci23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"sci23.tex"'"':sci23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "sci23.txt", label"':seeout}

{com}.         global x "delta_SCI1 delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F( 10,  1885) ={res}   16.77
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0814
                                                       {txt}Root MSE      = {res} .05087

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .0664749{col 26}{space 2} .0324782{col 37}{space 1}    2.05{col 46}{space 3}0.041{col 54}{space 4}  .002778{col 67}{space 3} .1301719
{txt}{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.0623096{col 26}{space 2} .0101741{col 37}{space 1}   -6.12{col 46}{space 3}0.000{col 54}{space 4}-.0822632{col 67}{space 3}-.0423559
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0091101{col 26}{space 2} .0024542{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .0042969{col 67}{space 3} .0139233
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} -.011546{col 26}{space 2} .0063024{col 37}{space 1}   -1.83{col 46}{space 3}0.067{col 54}{space 4}-.0239063{col 67}{space 3} .0008144
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0041768{col 26}{space 2}  .004479{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-.0129611{col 67}{space 3} .0046074
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0036527{col 26}{space 2} .0040289{col 37}{space 1}    0.91{col 46}{space 3}0.365{col 54}{space 4}-.0042488{col 67}{space 3} .0115542
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0000484{col 26}{space 2} .0039835{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-.0077641{col 67}{space 3}  .007861
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0078399{col 26}{space 2} .0033093{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} .0013496{col 67}{space 3} .0143302
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0114154{col 26}{space 2} .0027292{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .0060629{col 67}{space 3} .0167679
{txt}{space 7}2013  {c |}{col 14}{res}{space 2} .0137522{col 26}{space 2}   .00306{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} .0077508{col 67}{space 3} .0197537
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0150654{col 26}{space 2} .0027821{col 37}{space 1}   -5.42{col 46}{space 3}0.000{col 54}{space 4}-.0205217{col 67}{space 3}-.0096091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using sci23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"sci23.tex"'"':sci23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "sci23.txt", label"':seeout}

{com}.         global x "delta_SCI1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1897
                                                       {txt}F(  9,  1887) ={res}   14.69
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0596
                                                       {txt}Root MSE      = {res} .05144

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .2066705{col 26}{space 2}  .023537{col 37}{space 1}    8.78{col 46}{space 3}0.000{col 54}{space 4} .1605093{col 67}{space 3} .2528317
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0099826{col 26}{space 2} .0024847{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .0051096{col 67}{space 3} .0148556
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0115812{col 26}{space 2}  .006483{col 37}{space 1}   -1.79{col 46}{space 3}0.074{col 54}{space 4}-.0242958{col 67}{space 3} .0011334
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0044774{col 26}{space 2} .0045499{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-.0134008{col 67}{space 3} .0044459
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0026751{col 26}{space 2} .0040413{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-.0052508{col 67}{space 3}  .010601
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0006342{col 26}{space 2} .0039969{col 37}{space 1}   -0.16{col 46}{space 3}0.874{col 54}{space 4}-.0084731{col 67}{space 3} .0072046
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}  .008313{col 26}{space 2} .0033233{col 37}{space 1}    2.50{col 46}{space 3}0.012{col 54}{space 4} .0017953{col 67}{space 3} .0148308
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0104182{col 26}{space 2} .0026641{col 37}{space 1}    3.91{col 46}{space 3}0.000{col 54}{space 4} .0051934{col 67}{space 3}  .015643
{txt}{space 7}2013  {c |}{col 14}{res}{space 2} .0120021{col 26}{space 2} .0030011{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} .0061164{col 67}{space 3} .0178879
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0155323{col 26}{space 2} .0027912{col 37}{space 1}   -5.56{col 46}{space 3}0.000{col 54}{space 4}-.0210065{col 67}{space 3} -.010058
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using sci23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"sci23.tex"'"':sci23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "sci23.txt", label"':seeout}

{com}.         global x "delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F(  9,  1886) ={res}    6.81
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0196
                                                       {txt}Root MSE      = {res} .05254

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.0109669{col 26}{space 2}  .007631{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.025933{col 67}{space 3} .0039992
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0104042{col 26}{space 2} .0025213{col 37}{space 1}    4.13{col 46}{space 3}0.000{col 54}{space 4} .0054594{col 67}{space 3}  .015349
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0107492{col 26}{space 2} .0065751{col 37}{space 1}   -1.63{col 46}{space 3}0.102{col 54}{space 4}-.0236445{col 67}{space 3}  .002146
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0032613{col 26}{space 2} .0046567{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-.0123942{col 67}{space 3} .0058715
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}  .002533{col 26}{space 2} .0041783{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.0056616{col 67}{space 3} .0107276
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0005568{col 26}{space 2} .0041004{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-.0085986{col 67}{space 3}  .007485
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0088107{col 26}{space 2} .0033782{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} .0021853{col 67}{space 3} .0154361
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0094601{col 26}{space 2} .0025578{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0044436{col 67}{space 3} .0144765
{txt}{space 7}2013  {c |}{col 14}{res}{space 2} .0103349{col 26}{space 2} .0024944{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .0054429{col 67}{space 3} .0152269
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0162996{col 26}{space 2} .0028419{col 37}{space 1}   -5.74{col 46}{space 3}0.000{col 54}{space 4}-.0218731{col 67}{space 3} -.010726
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using sci23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"sci23.tex"'"':sci23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "sci23.txt", label"':seeout}

{com}.         global x "delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1896
                                                       {txt}F(  9,  1886) ={res}   17.92
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0791
                                                       {txt}Root MSE      = {res} .05092

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_SCI23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.0760628{col 26}{space 2} .0073197{col 37}{space 1}  -10.39{col 46}{space 3}0.000{col 54}{space 4}-.0904183{col 67}{space 3}-.0617072
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0089718{col 26}{space 2} .0024583{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .0041506{col 67}{space 3}  .013793
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0113645{col 26}{space 2} .0062744{col 37}{space 1}   -1.81{col 46}{space 3}0.070{col 54}{space 4}  -.02367{col 67}{space 3} .0009411
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0038558{col 26}{space 2} .0044871{col 37}{space 1}   -0.86{col 46}{space 3}0.390{col 54}{space 4}-.0126561{col 67}{space 3} .0049444
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0038822{col 26}{space 2} .0040341{col 37}{space 1}    0.96{col 46}{space 3}0.336{col 54}{space 4}-.0040296{col 67}{space 3}  .011794
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0002315{col 26}{space 2} .0039901{col 37}{space 1}    0.06{col 46}{space 3}0.954{col 54}{space 4}-.0075939{col 67}{space 3} .0080569
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0078226{col 26}{space 2} .0033129{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0013253{col 67}{space 3}   .01432
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0114891{col 26}{space 2} .0027129{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0061686{col 67}{space 3} .0168097
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}  .013886{col 26}{space 2} .0029936{col 37}{space 1}    4.64{col 46}{space 3}0.000{col 54}{space 4} .0080148{col 67}{space 3} .0197572
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0151036{col 26}{space 2} .0027862{col 37}{space 1}   -5.42{col 46}{space 3}0.000{col 54}{space 4} -.020568{col 67}{space 3}-.0096393
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using sci23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"sci23.tex"'"':sci23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "sci23.txt", label"':seeout}

{com}. 
.         global y = "delta_MIX23"
{txt}
{com}.         global x "delta_SCI1 delta_MIX1"
{txt}
{com}.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  9,  1475) ={res}    8.75
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0543
                                                       {txt}Root MSE      = {res} .15439

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .3183072{col 26}{space 2} .1117547{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .0990921{col 67}{space 3} .5375223
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .2373294{col 26}{space 2} .0333566{col 37}{space 1}    7.11{col 46}{space 3}0.000{col 54}{space 4} .1718979{col 67}{space 3} .3027609
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0231201{col 26}{space 2}  .008375{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 54}{space 4}  .006692{col 67}{space 3} .0395483
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0171431{col 26}{space 2} .0186062{col 37}{space 1}    0.92{col 46}{space 3}0.357{col 54}{space 4}-.0193543{col 67}{space 3} .0536405
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0188492{col 26}{space 2} .0131715{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4} -.044686{col 67}{space 3} .0069876
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0160428{col 26}{space 2}    .0124{col 37}{space 1}    1.29{col 46}{space 3}0.196{col 54}{space 4}-.0082807{col 67}{space 3} .0403664
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0009572{col 26}{space 2} .0122372{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-.0230469{col 67}{space 3} .0249614
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0030434{col 26}{space 2} .0129431{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 54}{space 4}-.0223454{col 67}{space 3} .0284323
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0671241{col 26}{space 2} .0582783{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.0471931{col 67}{space 3} .1814413
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0448306{col 26}{space 2} .0100286{col 37}{space 1}   -4.47{col 46}{space 3}0.000{col 54}{space 4}-.0645025{col 67}{space 3}-.0251587
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using mix23, label replace dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"mix23.tex"'"':mix23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "mix23.txt", label"':seeout}

{com}.         global x "delta_OTH1 delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  9,  1475) ={res}    8.87
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0546
                                                       {txt}Root MSE      = {res} .15436

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.0716444{col 26}{space 2} .0243475{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-.1194038{col 67}{space 3}-.0238851
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .1675472{col 26}{space 2} .0248398{col 37}{space 1}    6.75{col 46}{space 3}0.000{col 54}{space 4}  .118822{col 67}{space 3} .2162724
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0230686{col 26}{space 2} .0083757{col 37}{space 1}    2.75{col 46}{space 3}0.006{col 54}{space 4}  .006639{col 67}{space 3} .0394982
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0167197{col 26}{space 2} .0186059{col 37}{space 1}    0.90{col 46}{space 3}0.369{col 54}{space 4}-.0197772{col 67}{space 3} .0532166
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0191627{col 26}{space 2} .0131761{col 37}{space 1}   -1.45{col 46}{space 3}0.146{col 54}{space 4}-.0450086{col 67}{space 3} .0066831
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}  .015722{col 26}{space 2} .0123897{col 37}{space 1}    1.27{col 46}{space 3}0.205{col 54}{space 4}-.0085813{col 67}{space 3} .0400253
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0009953{col 26}{space 2} .0122198{col 37}{space 1}    0.08{col 46}{space 3}0.935{col 54}{space 4}-.0229747{col 67}{space 3} .0249654
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0026305{col 26}{space 2} .0129493{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4}-.0227706{col 67}{space 3} .0280315
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0669015{col 26}{space 2} .0582212{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-.0473038{col 67}{space 3} .1811068
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} -.044498{col 26}{space 2} .0100232{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0641593{col 67}{space 3}-.0248367
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using mix23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"mix23.tex"'"':mix23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "mix23.txt", label"':seeout}

{com}.         global x "delta_SCI1 delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  9,  1475) ={res}    8.99
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0547
                                                       {txt}Root MSE      = {res} .15435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.7613713{col 26}{space 2}  .111828{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.9807302{col 67}{space 3}-.5420124
{txt}{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.2362149{col 26}{space 2} .0327071{col 37}{space 1}   -7.22{col 46}{space 3}0.000{col 54}{space 4}-.3003723{col 67}{space 3}-.1720576
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0230641{col 26}{space 2} .0083789{col 37}{space 1}    2.75{col 46}{space 3}0.006{col 54}{space 4} .0066283{col 67}{space 3} .0394998
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0156356{col 26}{space 2} .0185916{col 37}{space 1}    0.84{col 46}{space 3}0.400{col 54}{space 4}-.0208332{col 67}{space 3} .0521044
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0199759{col 26}{space 2} .0131895{col 37}{space 1}   -1.51{col 46}{space 3}0.130{col 54}{space 4}-.0458481{col 67}{space 3} .0058963
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0147098{col 26}{space 2} .0123854{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4} -.009585{col 67}{space 3} .0390046
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0009718{col 26}{space 2} .0121987{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-.0229568{col 67}{space 3} .0249004
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0015684{col 26}{space 2} .0129535{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}-.0238409{col 67}{space 3} .0269777
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0668944{col 26}{space 2} .0579582{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.0467948{col 67}{space 3} .1805836
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0436752{col 26}{space 2} .0100102{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4} -.063311{col 67}{space 3}-.0240394
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using mix23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"mix23.tex"'"':mix23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "mix23.txt", label"':seeout}

{com}.         global x "delta_SCI1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1486
                                                       {txt}F(  8,  1477) ={res}    3.34
                                                       {txt}Prob > F      = {res} 0.0009
                                                       {txt}R-squared     = {res} 0.0181
                                                       {txt}Root MSE      = {res} .15732

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.2445251{col 26}{space 2} .0845547{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.4103853{col 67}{space 3} -.078665
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0258589{col 26}{space 2} .0084988{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} .0091879{col 67}{space 3}   .04253
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0129628{col 26}{space 2} .0186557{col 37}{space 1}    0.69{col 46}{space 3}0.487{col 54}{space 4}-.0236316{col 67}{space 3} .0495573
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0233698{col 26}{space 2} .0134689{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4}-.0497899{col 67}{space 3} .0030504
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0084447{col 26}{space 2} .0127929{col 37}{space 1}    0.66{col 46}{space 3}0.509{col 54}{space 4}-.0166495{col 67}{space 3}  .033539
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0013008{col 26}{space 2} .0124578{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-.0257377{col 67}{space 3} .0231362
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0008637{col 26}{space 2} .0131584{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-.0249473{col 67}{space 3} .0266748
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0797737{col 26}{space 2}  .056531{col 37}{space 1}    1.41{col 46}{space 3}0.158{col 54}{space 4}-.0311159{col 67}{space 3} .1906632
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0425476{col 26}{space 2}  .010243{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}  -.06264{col 67}{space 3}-.0224552
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using mix23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"mix23.tex"'"':mix23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "mix23.txt", label"':seeout}

{com}.         global x "delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  8,  1476) ={res}    8.63
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0486
                                                       {txt}Root MSE      = {res}  .1548

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .1721773{col 26}{space 2}  .024806{col 37}{space 1}    6.94{col 46}{space 3}0.000{col 54}{space 4} .1235185{col 67}{space 3} .2208361
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0242731{col 26}{space 2} .0083858{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} .0078237{col 67}{space 3} .0407225
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0162005{col 26}{space 2} .0186978{col 37}{space 1}    0.87{col 46}{space 3}0.386{col 54}{space 4}-.0204765{col 67}{space 3} .0528775
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0195197{col 26}{space 2}  .013149{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-.0453125{col 67}{space 3} .0062731
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0134146{col 26}{space 2} .0125449{col 37}{space 1}    1.07{col 46}{space 3}0.285{col 54}{space 4}-.0111932{col 67}{space 3} .0380224
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0001089{col 26}{space 2} .0123027{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4}-.0242415{col 67}{space 3} .0240237
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0018566{col 26}{space 2} .0130338{col 37}{space 1}    0.14{col 46}{space 3}0.887{col 54}{space 4}-.0237102{col 67}{space 3} .0274235
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} .0720853{col 26}{space 2} .0570129{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0397495{col 67}{space 3} .1839202
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0443568{col 26}{space 2} .0100895{col 37}{space 1}   -4.40{col 46}{space 3}0.000{col 54}{space 4}-.0641481{col 67}{space 3}-.0245656
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using mix23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"mix23.tex"'"':mix23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "mix23.txt", label"':seeout}

{com}.         global x "delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1485
                                                       {txt}F(  8,  1476) ={res}    3.91
                                                       {txt}Prob > F      = {res} 0.0001
                                                       {txt}R-squared     = {res} 0.0197
                                                       {txt}Root MSE      = {res} .15714

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_MIX23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.0831696{col 26}{space 2} .0247261{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.1316718{col 67}{space 3}-.0346675
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0235431{col 26}{space 2} .0085138{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0068426{col 67}{space 3} .0402436
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}  .013361{col 26}{space 2} .0183774{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4}-.0226875{col 67}{space 3} .0494095
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0236776{col 26}{space 2}  .013632{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4}-.0504177{col 67}{space 3} .0030625
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0120772{col 26}{space 2} .0126009{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.0126404{col 67}{space 3} .0367948
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0003514{col 26}{space 2} .0123816{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-.0246388{col 67}{space 3} .0239359
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0026286{col 26}{space 2}  .013045{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.0229601{col 67}{space 3} .0282172
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}  .071264{col 26}{space 2} .0583388{col 37}{space 1}    1.22{col 46}{space 3}0.222{col 54}{space 4}-.0431718{col 67}{space 3} .1856998
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0423518{col 26}{space 2} .0101478{col 37}{space 1}   -4.17{col 46}{space 3}0.000{col 54}{space 4}-.0622575{col 67}{space 3} -.022446
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using mix23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"mix23.tex"'"':mix23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "mix23.txt", label"':seeout}

{com}. 
.         
.         global y = "delta_OTH23"
{txt}
{com}.         global x "delta_SCI1 delta_MIX1"
{txt}
{com}.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F( 10,  1493) ={res}   15.02
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1045
                                                       {txt}Root MSE      = {res} .08624

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.7042144{col 26}{space 2} .0639461{col 37}{space 1}  -11.01{col 46}{space 3}0.000{col 54}{space 4}-.8296482{col 67}{space 3}-.5787807
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.1663253{col 26}{space 2}  .018905{col 37}{space 1}   -8.80{col 46}{space 3}0.000{col 54}{space 4}-.2034084{col 67}{space 3}-.1292422
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0172457{col 26}{space 2} .0045573{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-.0261852{col 67}{space 3}-.0083062
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0095552{col 26}{space 2} .0101072{col 37}{space 1}    0.95{col 46}{space 3}0.345{col 54}{space 4}-.0102706{col 67}{space 3}  .029381
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0027209{col 26}{space 2} .0071188{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4} -.011243{col 67}{space 3} .0166848
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0182944{col 26}{space 2} .0070754{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-.0321732{col 67}{space 3}-.0044156
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0070228{col 26}{space 2} .0068967{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4} -.020551{col 67}{space 3} .0065054
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0140296{col 26}{space 2} .0070122{col 37}{space 1}   -2.00{col 46}{space 3}0.046{col 54}{space 4}-.0277843{col 67}{space 3}-.0002748
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0248842{col 26}{space 2} .0496343{col 37}{space 1}   -0.50{col 46}{space 3}0.616{col 54}{space 4}-.1222446{col 67}{space 3} .0724763
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0244296{col 26}{space 2} .0108165{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.0456467{col 67}{space 3}-.0032125
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0292549{col 26}{space 2} .0051338{col 37}{space 1}    5.70{col 46}{space 3}0.000{col 54}{space 4} .0191847{col 67}{space 3} .0393251
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using oth23, label replace dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"oth23.tex"'"':oth23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "oth23.txt", label"':seeout}

{com}.         global x "delta_OTH1 delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F( 10,  1493) ={res}   14.57
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1027
                                                       {txt}Root MSE      = {res} .08632

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2} .1514184{col 26}{space 2} .0139931{col 37}{space 1}   10.82{col 46}{space 3}0.000{col 54}{space 4} .1239701{col 67}{space 3} .1788667
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.0122389{col 26}{space 2} .0130727{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-.0378817{col 67}{space 3}  .013404
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0170944{col 26}{space 2} .0045632{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-.0260453{col 67}{space 3}-.0081435
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0105515{col 26}{space 2}  .010091{col 37}{space 1}    1.05{col 46}{space 3}0.296{col 54}{space 4}-.0092425{col 67}{space 3} .0303456
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}  .003468{col 26}{space 2} .0071151{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.0104887{col 67}{space 3} .0174247
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0173599{col 26}{space 2} .0070709{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.0312298{col 67}{space 3}  -.00349
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0069925{col 26}{space 2} .0069017{col 37}{space 1}   -1.01{col 46}{space 3}0.311{col 54}{space 4}-.0205307{col 67}{space 3} .0065456
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0130559{col 26}{space 2} .0070068{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-.0268001{col 67}{space 3} .0006884
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0243901{col 26}{space 2} .0498434{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-.1221606{col 67}{space 3} .0733805
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0204779{col 26}{space 2} .0126966{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4}-.0453829{col 67}{space 3} .0044272
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0283967{col 26}{space 2} .0051271{col 37}{space 1}    5.54{col 46}{space 3}0.000{col 54}{space 4} .0183397{col 67}{space 3} .0384538
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using oth23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"oth23.tex"'"':oth23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "oth23.txt", label"':seeout}

{com}.         global x "delta_SCI1 delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F( 10,  1493) ={res}   14.52
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1024
                                                       {txt}Root MSE      = {res} .08633

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .0421901{col 26}{space 2} .0592664{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.0740642{col 67}{space 3} .1584444
{txt}{space 2}delta_OTH1 {c |}{col 14}{res}{space 2} .1606945{col 26}{space 2} .0187443{col 37}{space 1}    8.57{col 46}{space 3}0.000{col 54}{space 4} .1239266{col 67}{space 3} .1974623
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0170959{col 26}{space 2} .0045642{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-.0260487{col 67}{space 3} -.008143
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0106715{col 26}{space 2} .0100792{col 37}{space 1}    1.06{col 46}{space 3}0.290{col 54}{space 4}-.0090994{col 67}{space 3} .0304423
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0035975{col 26}{space 2} .0071168{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4}-.0103625{col 67}{space 3} .0175575
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0172374{col 26}{space 2} .0070621{col 37}{space 1}   -2.44{col 46}{space 3}0.015{col 54}{space 4}-.0310901{col 67}{space 3}-.0033847
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0069662{col 26}{space 2} .0069022{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-.0205052{col 67}{space 3} .0065729
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0129935{col 26}{space 2} .0070072{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.0267384{col 67}{space 3} .0007515
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0244525{col 26}{space 2}  .049836{col 37}{space 1}   -0.49{col 46}{space 3}0.624{col 54}{space 4}-.1222084{col 67}{space 3} .0733035
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0201185{col 26}{space 2} .0128769{col 37}{space 1}   -1.56{col 46}{space 3}0.118{col 54}{space 4}-.0453773{col 67}{space 3} .0051404
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0283081{col 26}{space 2} .0051231{col 37}{space 1}    5.53{col 46}{space 3}0.000{col 54}{space 4} .0182588{col 67}{space 3} .0383574
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using oth23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"oth23.tex"'"':oth23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "oth23.txt", label"':seeout}

{com}.         global x "delta_SCI1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1505
                                                       {txt}F(  9,  1495) ={res}    8.49
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0503
                                                       {txt}Root MSE      = {res} .08875

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.3091536{col 26}{space 2} .0452875{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.3979874{col 67}{space 3}-.2203197
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0192091{col 26}{space 2} .0046731{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.0283755{col 67}{space 3}-.0100426
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0124827{col 26}{space 2} .0104421{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-.0080001{col 67}{space 3} .0329655
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0060744{col 26}{space 2} .0072857{col 37}{space 1}    0.83{col 46}{space 3}0.405{col 54}{space 4}-.0082169{col 67}{space 3} .0203656
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0129992{col 26}{space 2}  .007183{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4} -.027089{col 67}{space 3} .0010906
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0049621{col 26}{space 2} .0070075{col 37}{space 1}   -0.71{col 46}{space 3}0.479{col 54}{space 4}-.0187076{col 67}{space 3} .0087834
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0124267{col 26}{space 2} .0072241{col 37}{space 1}   -1.72{col 46}{space 3}0.086{col 54}{space 4}-.0265972{col 67}{space 3} .0017437
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0312758{col 26}{space 2} .0503804{col 37}{space 1}   -0.62{col 46}{space 3}0.535{col 54}{space 4}-.1300996{col 67}{space 3}  .067548
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0182495{col 26}{space 2} .0088699{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-.0356482{col 67}{space 3}-.0008508
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0276843{col 26}{space 2} .0052268{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} .0174317{col 67}{space 3} .0379368
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using oth23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"oth23.tex"'"':oth23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "oth23.txt", label"':seeout}

{com}.         global x "delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F(  9,  1494) ={res}    4.72
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0203
                                                       {txt}Root MSE      = {res} .09017

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} -.021301{col 26}{space 2} .0134997{col 37}{space 1}   -1.58{col 46}{space 3}0.115{col 54}{space 4}-.0477814{col 67}{space 3} .0051795
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0199512{col 26}{space 2}  .004723{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.0292156{col 67}{space 3}-.0106868
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}  .011654{col 26}{space 2} .0105889{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-.0091167{col 67}{space 3} .0324246
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0043575{col 26}{space 2} .0073023{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 54}{space 4}-.0099664{col 67}{space 3} .0186813
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0125507{col 26}{space 2}  .007421{col 37}{space 1}   -1.69{col 46}{space 3}0.091{col 54}{space 4}-.0271074{col 67}{space 3} .0020061
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0045212{col 26}{space 2} .0071818{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4}-.0186087{col 67}{space 3} .0095663
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0114826{col 26}{space 2} .0073735{col 37}{space 1}   -1.56{col 46}{space 3}0.120{col 54}{space 4}-.0259461{col 67}{space 3}  .002981
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0311511{col 26}{space 2} .0519286{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-.1330119{col 67}{space 3} .0707097
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0196568{col 26}{space 2} .0057185{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4} -.030874{col 67}{space 3}-.0084396
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0282976{col 26}{space 2} .0053398{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} .0178233{col 67}{space 3}  .038772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using oth23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"oth23.tex"'"':oth23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "oth23.txt", label"':seeout}

{com}.         global x "delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1504
                                                       {txt}F(  9,  1494) ={res}   16.11
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1021
                                                       {txt}Root MSE      = {res} .08632

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} delta_OTH23{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2} .1521967{col 26}{space 2} .0140051{col 37}{space 1}   10.87{col 46}{space 3}0.000{col 54}{space 4} .1247249{col 67}{space 3} .1796685
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0171383{col 26}{space 2}  .004563{col 37}{space 1}   -3.76{col 46}{space 3}0.000{col 54}{space 4}-.0260889{col 67}{space 3}-.0081877
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0107972{col 26}{space 2}  .010062{col 37}{space 1}    1.07{col 46}{space 3}0.283{col 54}{space 4}-.0089401{col 67}{space 3} .0305344
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0038133{col 26}{space 2} .0071272{col 37}{space 1}    0.54{col 46}{space 3}0.593{col 54}{space 4}-.0101672{col 67}{space 3} .0177937
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0170874{col 26}{space 2} .0070395{col 37}{space 1}   -2.43{col 46}{space 3}0.015{col 54}{space 4}-.0308959{col 67}{space 3} -.003279
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-.0068916{col 26}{space 2} .0068927{col 37}{space 1}   -1.00{col 46}{space 3}0.318{col 54}{space 4} -.020412{col 67}{space 3} .0066287
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0130387{col 26}{space 2}  .007005{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 54}{space 4}-.0267794{col 67}{space 3}  .000702
{txt}{space 7}2012  {c |}{col 14}{res}{space 2} -.024767{col 26}{space 2} .0497469{col 37}{space 1}   -0.50{col 46}{space 3}0.619{col 54}{space 4}-.1223482{col 67}{space 3} .0728142
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0199783{col 26}{space 2} .0129108{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-.0453035{col 67}{space 3} .0053469
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0282453{col 26}{space 2} .0051181{col 37}{space 1}    5.52{col 46}{space 3}0.000{col 54}{space 4} .0182058{col 67}{space 3} .0382847
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using oth23, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"oth23.tex"'"':oth23.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "oth23.txt", label"':seeout}

{com}.         global y = "quant_2"
{txt}
{com}.         global x "delta_SCI1 delta_MIX1"
{txt}
{com}.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 11,  1897) ={res}    5.90
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0307
                                                       {txt}Root MSE      = {res} .20846

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .4852183{col 26}{space 2} .1156213{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4}   .25846{col 67}{space 3} .7119766
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .1802611{col 26}{space 2} .0322624{col 37}{space 1}    5.59{col 46}{space 3}0.000{col 54}{space 4} .1169876{col 67}{space 3} .2435346
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0056362{col 26}{space 2} .0101359{col 37}{space 1}   -0.56{col 46}{space 3}0.578{col 54}{space 4} -.025515{col 67}{space 3} .0142426
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0352738{col 26}{space 2} .0156516{col 37}{space 1}    2.25{col 46}{space 3}0.024{col 54}{space 4} .0045776{col 67}{space 3} .0659699
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0611369{col 26}{space 2} .0143452{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} .0330028{col 67}{space 3}  .089271
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0726562{col 26}{space 2} .0145938{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} .0440346{col 67}{space 3} .1012777
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0488052{col 26}{space 2} .0151723{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4}  .019049{col 67}{space 3} .0785614
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0285632{col 26}{space 2} .0178544{col 37}{space 1}    1.60{col 46}{space 3}0.110{col 54}{space 4}-.0064531{col 67}{space 3} .0635795
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0045225{col 26}{space 2} .0256685{col 37}{space 1}   -0.18{col 46}{space 3}0.860{col 54}{space 4}-.0548639{col 67}{space 3}  .045819
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0413799{col 26}{space 2} .0445888{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-.1288281{col 67}{space 3} .0460683
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0300988{col 26}{space 2} .0774276{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-.1217535{col 67}{space 3} .1819511
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5478396{col 26}{space 2} .0129809{col 37}{space 1}   42.20{col 46}{space 3}0.000{col 54}{space 4} .5223812{col 67}{space 3}  .573298
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using quant2, label replace dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"quant2.tex"'"':quant2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "quant2.txt", label"':seeout}

{com}.         global x "delta_OTH1 delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 11,  1897) ={res}    5.99
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0306
                                                       {txt}Root MSE      = {res} .20847

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2} -.107597{col 26}{space 2} .0247577{col 37}{space 1}   -4.35{col 46}{space 3}0.000{col 54}{space 4}-.1561522{col 67}{space 3}-.0590419
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .0727888{col 26}{space 2} .0229335{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .0278112{col 67}{space 3} .1177664
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0058232{col 26}{space 2} .0101318{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-.0256938{col 67}{space 3} .0140475
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0347742{col 26}{space 2} .0156839{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} .0040147{col 67}{space 3} .0655337
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0607947{col 26}{space 2} .0143537{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0326439{col 67}{space 3} .0889454
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0722689{col 26}{space 2} .0145865{col 37}{space 1}    4.95{col 46}{space 3}0.000{col 54}{space 4} .0436616{col 67}{space 3} .1008763
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0491167{col 26}{space 2} .0151693{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} .0193664{col 67}{space 3}  .078867
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0282504{col 26}{space 2} .0178473{col 37}{space 1}    1.58{col 46}{space 3}0.114{col 54}{space 4}-.0067519{col 67}{space 3} .0632528
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0048488{col 26}{space 2} .0256841{col 37}{space 1}   -0.19{col 46}{space 3}0.850{col 54}{space 4}-.0552207{col 67}{space 3} .0455232
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0420395{col 26}{space 2} .0445374{col 37}{space 1}   -0.94{col 46}{space 3}0.345{col 54}{space 4}-.1293869{col 67}{space 3} .0453078
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0275291{col 26}{space 2} .0781963{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4}-.1258307{col 67}{space 3} .1808889
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5482736{col 26}{space 2} .0129808{col 37}{space 1}   42.24{col 46}{space 3}0.000{col 54}{space 4} .5228154{col 67}{space 3} .5737318
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using quant2, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"quant2.tex"'"':quant2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "quant2.txt", label"':seeout}

{com}.         global x "delta_SCI1 delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 11,  1897) ={res}    5.97
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0304
                                                       {txt}Root MSE      = {res}  .2085

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.3117509{col 26}{space 2} .1064482{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4}-.5205187{col 67}{space 3}-.1029832
{txt}{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.1760953{col 26}{space 2} .0317895{col 37}{space 1}   -5.54{col 46}{space 3}0.000{col 54}{space 4}-.2384413{col 67}{space 3}-.1137493
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0058936{col 26}{space 2} .0101303{col 37}{space 1}   -0.58{col 46}{space 3}0.561{col 54}{space 4}-.0257614{col 67}{space 3} .0139742
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0343991{col 26}{space 2} .0156915{col 37}{space 1}    2.19{col 46}{space 3}0.028{col 54}{space 4} .0036247{col 67}{space 3} .0651735
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0604917{col 26}{space 2} .0143456{col 37}{space 1}    4.22{col 46}{space 3}0.000{col 54}{space 4} .0323569{col 67}{space 3} .0886265
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0719349{col 26}{space 2} .0145752{col 37}{space 1}    4.94{col 46}{space 3}0.000{col 54}{space 4} .0433498{col 67}{space 3} .1005201
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0492733{col 26}{space 2} .0151689{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0195238{col 67}{space 3} .0790228
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0280548{col 26}{space 2} .0178439{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-.0069409{col 67}{space 3} .0630505
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0051106{col 26}{space 2} .0257027{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-.0555192{col 67}{space 3}  .045298
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0425586{col 26}{space 2} .0445044{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-.1298413{col 67}{space 3}  .044724
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0257505{col 26}{space 2} .0786337{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4} -.128467{col 67}{space 3}  .179968
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .548559{col 26}{space 2} .0129768{col 37}{space 1}   42.27{col 46}{space 3}0.000{col 54}{space 4} .5231086{col 67}{space 3} .5740093
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using quant2, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"quant2.tex"'"':quant2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "quant2.txt", label"':seeout}

{com}.         global x "delta_SCI1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1910
                                                       {txt}F( 10,  1899) ={res}    3.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0194
                                                       {txt}Root MSE      = {res} .20957

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .0847456{col 26}{space 2} .0831973{col 37}{space 1}    1.02{col 46}{space 3}0.309{col 54}{space 4} -.078422{col 67}{space 3} .2479133
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0031279{col 26}{space 2} .0101889{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-.0231106{col 67}{space 3} .0168547
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0343034{col 26}{space 2} .0155367{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0038326{col 67}{space 3} .0647742
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0596547{col 26}{space 2} .0143744{col 37}{space 1}    4.15{col 46}{space 3}0.000{col 54}{space 4} .0314634{col 67}{space 3} .0878459
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0691531{col 26}{space 2} .0145807{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 54}{space 4} .0405572{col 67}{space 3} .0977489
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0475971{col 26}{space 2} .0153137{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0175637{col 67}{space 3} .0776306
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0294012{col 26}{space 2} .0179431{col 37}{space 1}    1.64{col 46}{space 3}0.101{col 54}{space 4} -.005789{col 67}{space 3} .0645915
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0079185{col 26}{space 2} .0258713{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.0586578{col 67}{space 3} .0428207
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0474734{col 26}{space 2} .0443464{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-.1344461{col 67}{space 3} .0394994
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0256746{col 26}{space 2}  .075811{col 37}{space 1}    0.34{col 46}{space 3}0.735{col 54}{space 4} -.123007{col 67}{space 3} .1743561
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5470417{col 26}{space 2} .0130682{col 37}{space 1}   41.86{col 46}{space 3}0.000{col 54}{space 4} .5214122{col 67}{space 3} .5726711
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using quant2, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"quant2.tex"'"':quant2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "quant2.txt", label"':seeout}

{com}.         global x "delta_MIX1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 10,  1898) ={res}    4.69
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0230
                                                       {txt}Root MSE      = {res} .20924

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .0786089{col 26}{space 2} .0228542{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0337868{col 67}{space 3} .1234309
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0038524{col 26}{space 2} .0101869{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-.0238311{col 67}{space 3} .0161263
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}  .035994{col 26}{space 2} .0155608{col 37}{space 1}    2.31{col 46}{space 3}0.021{col 54}{space 4} .0054759{col 67}{space 3} .0665121
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}  .062159{col 26}{space 2}  .014358{col 37}{space 1}    4.33{col 46}{space 3}0.000{col 54}{space 4} .0339999{col 67}{space 3} .0903181
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0707826{col 26}{space 2} .0146493{col 37}{space 1}    4.83{col 46}{space 3}0.000{col 54}{space 4} .0420521{col 67}{space 3} .0995131
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0482158{col 26}{space 2} .0153161{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .0181776{col 67}{space 3}  .078254
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0296709{col 26}{space 2} .0179001{col 37}{space 1}    1.66{col 46}{space 3}0.098{col 54}{space 4}-.0054351{col 67}{space 3} .0647769
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0075072{col 26}{space 2} .0258769{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-.0582574{col 67}{space 3}  .043243
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0466621{col 26}{space 2} .0443365{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-.1336154{col 67}{space 3} .0402912
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0289246{col 26}{space 2} .0779519{col 37}{space 1}    0.37{col 46}{space 3}0.711{col 54}{space 4}-.1239558{col 67}{space 3}  .181805
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5463759{col 26}{space 2} .0131013{col 37}{space 1}   41.70{col 46}{space 3}0.000{col 54}{space 4} .5206815{col 67}{space 3} .5720703
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using quant2, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"quant2.tex"'"':quant2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "quant2.txt", label"':seeout}

{com}.         global x "delta_OTH1"
{txt}
{com}.         reg $y $x  $params, robust

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 10,  1898) ={res}    5.62
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0272
                                                       {txt}Root MSE      = {res} .20878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.1114431{col 26}{space 2} .0246026{col 37}{space 1}   -4.53{col 46}{space 3}0.000{col 54}{space 4}-.1596941{col 67}{space 3}-.0631922
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0051609{col 26}{space 2} .0101361{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-.0250399{col 67}{space 3} .0147181
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0335511{col 26}{space 2} .0156262{col 37}{space 1}    2.15{col 46}{space 3}0.032{col 54}{space 4} .0029048{col 67}{space 3} .0641974
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0589918{col 26}{space 2} .0143427{col 37}{space 1}    4.11{col 46}{space 3}0.000{col 54}{space 4} .0308626{col 67}{space 3}  .087121
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0708512{col 26}{space 2} .0145379{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4} .0423392{col 67}{space 3} .0993632
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0484121{col 26}{space 2}  .015197{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .0186075{col 67}{space 3} .0782167
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0281407{col 26}{space 2} .0178838{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-.0069333{col 67}{space 3} .0632146
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0054576{col 26}{space 2} .0257006{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-.0558619{col 67}{space 3} .0449467
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0431849{col 26}{space 2} .0445002{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4}-.1304594{col 67}{space 3} .0440897
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0248672{col 26}{space 2} .0768043{col 37}{space 1}    0.32{col 46}{space 3}0.746{col 54}{space 4}-.1257625{col 67}{space 3} .1754969
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5486819{col 26}{space 2} .0129646{col 37}{space 1}   42.32{col 46}{space 3}0.000{col 54}{space 4} .5232555{col 67}{space 3} .5741083
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using quant2, label append dec(3) tex(frag pr) drop(ib(2010).debut i.sexe)
{txt}{stata `"shellout using `"quant2.tex"'"':quant2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "quant2.txt", label"':seeout}

{com}. 
.         
.         global x "delta_SCI1 delta_MIX1"
{txt}
{com}.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         
.         reg quant_2 $x  $params , robust

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 11,  1897) ={res}    5.90
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0307
                                                       {txt}Root MSE      = {res} .20846

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .4852183{col 26}{space 2} .1156213{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4}   .25846{col 67}{space 3} .7119766
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .1802611{col 26}{space 2} .0322624{col 37}{space 1}    5.59{col 46}{space 3}0.000{col 54}{space 4} .1169876{col 67}{space 3} .2435346
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0056362{col 26}{space 2} .0101359{col 37}{space 1}   -0.56{col 46}{space 3}0.578{col 54}{space 4} -.025515{col 67}{space 3} .0142426
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0352738{col 26}{space 2} .0156516{col 37}{space 1}    2.25{col 46}{space 3}0.024{col 54}{space 4} .0045776{col 67}{space 3} .0659699
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0611369{col 26}{space 2} .0143452{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} .0330028{col 67}{space 3}  .089271
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0726562{col 26}{space 2} .0145938{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 54}{space 4} .0440346{col 67}{space 3} .1012777
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0488052{col 26}{space 2} .0151723{col 37}{space 1}    3.22{col 46}{space 3}0.001{col 54}{space 4}  .019049{col 67}{space 3} .0785614
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0285632{col 26}{space 2} .0178544{col 37}{space 1}    1.60{col 46}{space 3}0.110{col 54}{space 4}-.0064531{col 67}{space 3} .0635795
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.0045225{col 26}{space 2} .0256685{col 37}{space 1}   -0.18{col 46}{space 3}0.860{col 54}{space 4}-.0548639{col 67}{space 3}  .045819
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0413799{col 26}{space 2} .0445888{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-.1288281{col 67}{space 3} .0460683
{txt}{space 7}2014  {c |}{col 14}{res}{space 2} .0300988{col 26}{space 2} .0774276{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-.1217535{col 67}{space 3} .1819511
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5478396{col 26}{space 2} .0129809{col 37}{space 1}   42.20{col 46}{space 3}0.000{col 54}{space 4} .5223812{col 67}{space 3}  .573298
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using results2, label replace dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"results2.tex"'"':results2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "results2.txt", label"':seeout}

{com}.         reg moyenne_2 $x $params , robust 

{txt}Linear regression                                      Number of obs ={res}    1909
                                                       {txt}F( 11,  1897) ={res}   65.95
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3645
                                                       {txt}Root MSE      = {res} .70311

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   moyenne_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} 1.272174{col 26}{space 2} .3841008{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .5188696{col 67}{space 3} 2.025478
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .5010071{col 26}{space 2} .1045379{col 37}{space 1}    4.79{col 46}{space 3}0.000{col 54}{space 4} .2959858{col 67}{space 3} .7060285
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0041064{col 26}{space 2} .0348973{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.0725476{col 67}{space 3} .0643347
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .0916419{col 26}{space 2} .0466968{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4} .0000594{col 67}{space 3} .1832245
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .2096313{col 26}{space 2} .0456828{col 37}{space 1}    4.59{col 46}{space 3}0.000{col 54}{space 4} .1200376{col 67}{space 3}  .299225
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}  .266222{col 26}{space 2} .0459121{col 37}{space 1}    5.80{col 46}{space 3}0.000{col 54}{space 4} .1761784{col 67}{space 3} .3562656
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .2148245{col 26}{space 2} .0497391{col 37}{space 1}    4.32{col 46}{space 3}0.000{col 54}{space 4} .1172755{col 67}{space 3} .3123735
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.1255175{col 26}{space 2} .0660874{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.2551291{col 67}{space 3}  .004094
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-1.620029{col 26}{space 2} .0932499{col 37}{space 1}  -17.37{col 46}{space 3}0.000{col 54}{space 4}-1.802912{col 67}{space 3}-1.437146
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-1.606652{col 26}{space 2} .1430054{col 37}{space 1}  -11.23{col 46}{space 3}0.000{col 54}{space 4}-1.887116{col 67}{space 3}-1.326188
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.8319772{col 26}{space 2} .1923806{col 37}{space 1}   -4.32{col 46}{space 3}0.000{col 54}{space 4}-1.209277{col 67}{space 3}-.4546775
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  4.19103{col 26}{space 2} .0475684{col 37}{space 1}   88.11{col 46}{space 3}0.000{col 54}{space 4} 4.097738{col 67}{space 3} 4.284322
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using results2, label append dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"results2.tex"'"':results2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "results2.txt", label"':seeout}

{com}.         reg quant_3 $x  $params , robust 

{txt}Linear regression                                      Number of obs ={res}    1103
                                                       {txt}F(  8,  1094) ={res}    3.77
                                                       {txt}Prob > F      = {res} 0.0002
                                                       {txt}R-squared     = {res} 0.0257
                                                       {txt}Root MSE      = {res}  .1571

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.2578641{col 26}{space 2} .1233216{col 37}{space 1}   -2.09{col 46}{space 3}0.037{col 54}{space 4}-.4998378{col 67}{space 3}-.0158904
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.0514934{col 26}{space 2} .0347659{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 54}{space 4}-.1197088{col 67}{space 3} .0167219
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}  -.03616{col 26}{space 2} .0097156{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.0552234{col 67}{space 3}-.0170966
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0238357{col 26}{space 2} .0192749{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-.0616558{col 67}{space 3} .0139843
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0000806{col 26}{space 2} .0152228{col 37}{space 1}   -0.01{col 46}{space 3}0.996{col 54}{space 4}-.0299497{col 67}{space 3} .0297885
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0071709{col 26}{space 2}  .014734{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-.0217392{col 67}{space 3}  .036081
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0208071{col 26}{space 2} .0149893{col 37}{space 1}    1.39{col 46}{space 3}0.165{col 54}{space 4} -.008604{col 67}{space 3} .0502181
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0361324{col 26}{space 2} .0151465{col 37}{space 1}    2.39{col 46}{space 3}0.017{col 54}{space 4}  .006413{col 67}{space 3} .0658519
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6587035{col 26}{space 2} .0115024{col 37}{space 1}   57.27{col 46}{space 3}0.000{col 54}{space 4} .6361343{col 67}{space 3} .6812727
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using results3, label replace dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"results3.tex"'"':results3.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "results3.txt", label"':seeout}

{com}.         reg moyenne_3 $x $params , robust 

{txt}Linear regression                                      Number of obs ={res}    1103
                                                       {txt}F(  8,  1094) ={res}    2.12
                                                       {txt}Prob > F      = {res} 0.0317
                                                       {txt}R-squared     = {res} 0.0147
                                                       {txt}Root MSE      = {res} .40286

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   moyenne_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.2635065{col 26}{space 2} .3167249{col 37}{space 1}   -0.83{col 46}{space 3}0.406{col 54}{space 4}-.8849635{col 67}{space 3} .3579505
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.0591789{col 26}{space 2} .0868408{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4}-.2295722{col 67}{space 3} .1112144
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0708711{col 26}{space 2} .0249057{col 37}{space 1}   -2.85{col 46}{space 3}0.005{col 54}{space 4}-.1197394{col 67}{space 3}-.0220027
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0912709{col 26}{space 2} .0485508{col 37}{space 1}   -1.88{col 46}{space 3}0.060{col 54}{space 4}-.1865341{col 67}{space 3} .0039923
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-.0051734{col 26}{space 2} .0397405{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-.0831495{col 67}{space 3} .0728028
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}-.0051696{col 26}{space 2} .0377223{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4}-.0791858{col 67}{space 3} .0688466
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0355334{col 26}{space 2} .0389685{col 37}{space 1}    0.91{col 46}{space 3}0.362{col 54}{space 4} -.040928{col 67}{space 3} .1119948
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0450899{col 26}{space 2} .0405996{col 37}{space 1}    1.11{col 46}{space 3}0.267{col 54}{space 4}-.0345719{col 67}{space 3} .1247518
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.782603{col 26}{space 2} .0307797{col 37}{space 1}  155.38{col 46}{space 3}0.000{col 54}{space 4} 4.722209{col 67}{space 3} 4.842997
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using results3, label append dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"results3.tex"'"':results3.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "results3.txt", label"':seeout}

{com}.         
. 
.         
.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         reg quant_2 $x  $params if vieuxCours == 1, robust 

{txt}Linear regression                                      Number of obs ={res}    1385
                                                       {txt}F(  7,  1377) ={res}    7.36
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0370
                                                       {txt}Root MSE      = {res} .18348

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .5085617{col 26}{space 2} .1152311{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .2825142{col 67}{space 3} .7346092
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .1703217{col 26}{space 2} .0316057{col 37}{space 1}    5.39{col 46}{space 3}0.000{col 54}{space 4} .1083212{col 67}{space 3} .2323223
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0075906{col 26}{space 2} .0104587{col 37}{space 1}    0.73{col 46}{space 3}0.468{col 54}{space 4} -.012926{col 67}{space 3} .0281072
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}  .035233{col 26}{space 2} .0155071{col 37}{space 1}    2.27{col 46}{space 3}0.023{col 54}{space 4} .0048129{col 67}{space 3} .0656532
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0613682{col 26}{space 2} .0143353{col 37}{space 1}    4.28{col 46}{space 3}0.000{col 54}{space 4} .0332467{col 67}{space 3} .0894896
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0716175{col 26}{space 2} .0145852{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4}  .043006{col 67}{space 3} .1002291
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0484829{col 26}{space 2} .0151716{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .0187209{col 67}{space 3} .0782448
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5392564{col 26}{space 2} .0131021{col 37}{space 1}   41.16{col 46}{space 3}0.000{col 54}{space 4} .5135542{col 67}{space 3} .5649586
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using robu2, label replace dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"robu2.tex"'"':robu2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "robu2.txt", label"':seeout}

{com}.         global params "i.sexe ib(2011).debut"
{txt}
{com}.         reg quant_2 $x  $params if vieuxCours == 0, robust 

{txt}Linear regression                                      Number of obs ={res}     524
                                                       {txt}F(  6,   517) ={res}    2.49
                                                       {txt}Prob > F      = {res} 0.0219
                                                       {txt}R-squared     = {res} 0.0228
                                                       {txt}Root MSE      = {res} .26323

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} .4417709{col 26}{space 2} .2994356{col 37}{space 1}    1.48{col 46}{space 3}0.141{col 54}{space 4}-.1464892{col 67}{space 3} 1.030031
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} .2437796{col 26}{space 2}  .098701{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .0498753{col 67}{space 3} .4376838
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0413308{col 26}{space 2} .0239767{col 37}{space 1}   -1.72{col 46}{space 3}0.085{col 54}{space 4}-.0884345{col 67}{space 3} .0057729
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2012  {c |}{col 14}{res}{space 2}-.0326955{col 26}{space 2} .0274236{col 37}{space 1}   -1.19{col 46}{space 3}0.234{col 54}{space 4}-.0865708{col 67}{space 3} .0211799
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-.0715095{col 26}{space 2} .0454339{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4}-.1607673{col 67}{space 3} .0177484
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.0020021{col 26}{space 2} .0776457{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4} -.154542{col 67}{space 3} .1505378
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .5981868{col 26}{space 2} .0201188{col 37}{space 1}   29.73{col 46}{space 3}0.000{col 54}{space 4} .5586622{col 67}{space 3} .6377115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using robu2, label append dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"robu2.tex"'"':robu2.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "robu2.txt", label"':seeout}

{com}. 
.         global params "i.sexe ib(2010).debut"
{txt}
{com}.         reg quant_3 $x  $params if vieuxCours == 1, robust 

{txt}Linear regression                                      Number of obs ={res}     931
                                                       {txt}F(  7,   923) ={res}    1.81
                                                       {txt}Prob > F      = {res} 0.0827
                                                       {txt}R-squared     = {res} 0.0136
                                                       {txt}Root MSE      = {res} .15782

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-.1330664{col 26}{space 2} .1323298{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-.3927686{col 67}{space 3} .1266357
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.0208875{col 26}{space 2} .0365796{col 37}{space 1}   -0.57{col 46}{space 3}0.568{col 54}{space 4}-.0926764{col 67}{space 3} .0509014
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0280552{col 26}{space 2} .0106879{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-.0490305{col 67}{space 3}-.0070798
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.0236584{col 26}{space 2} .0192489{col 37}{space 1}   -1.23{col 46}{space 3}0.219{col 54}{space 4}-.0614351{col 67}{space 3} .0141183
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0003904{col 26}{space 2} .0152105{col 37}{space 1}    0.03{col 46}{space 3}0.980{col 54}{space 4}-.0294607{col 67}{space 3} .0302416
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0077239{col 26}{space 2}  .014725{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4}-.0211744{col 67}{space 3} .0366223
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0211043{col 26}{space 2} .0150031{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-.0083398{col 67}{space 3} .0505485
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .6530463{col 26}{space 2} .0118716{col 37}{space 1}   55.01{col 46}{space 3}0.000{col 54}{space 4} .6297478{col 67}{space 3} .6763448
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using robu3, label replace dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"robu3.tex"'"':robu3.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "robu3.txt", label"':seeout}

{com}.         global params "i.sexe ib(2011).debut"
{txt}
{com}.         reg quant_3 $x  $params if vieuxCours == 0, robust 

{txt}Linear regression                                      Number of obs ={res}     172
                                                       {txt}F(  3,   168) ={res}   10.44
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1236
                                                       {txt}Root MSE      = {res} .14885

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2}-1.230736{col 26}{space 2} .3148547{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-1.852317{col 67}{space 3}-.6091541
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2}-.2980956{col 26}{space 2}  .100362{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-.4962288{col 67}{space 3}-.0999623
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0814513{col 26}{space 2} .0233459{col 37}{space 1}   -3.49{col 46}{space 3}0.001{col 54}{space 4}-.1275404{col 67}{space 3}-.0353621
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .7249628{col 26}{space 2} .0170371{col 37}{space 1}   42.55{col 46}{space 3}0.000{col 54}{space 4} .6913283{col 67}{space 3} .7585973
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using robu3, label append dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"robu3.tex"'"':robu3.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "robu3.txt", label"':seeout}

{com}.         
.         global params "i.sexe ib(52).matu_nom" //eco
{txt}
{com}.         reg moyenne $params, robust 

{txt}Linear regression                                      Number of obs ={res}    2460
                                                       {txt}F( 12,  2447) ={res}   44.43
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1535
                                                       {txt}Root MSE      = {res} .85805

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                            moyenne{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      t{col 85}   P>|t|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2} .0152176{col 65}{space 2}  .037201{col 76}{space 1}    0.41{col 85}{space 3}0.683{col 93}{space 4}-.0577312{col 106}{space 3} .0881663
{txt}{space 51} {c |}
{space 43}matu_nom {c |}
{space 49}0  {c |}{col 53}{res}{space 2}-.5634335{col 65}{space 2}  .085388{col 76}{space 1}   -6.60{col 85}{space 3}0.000{col 93}{space 4}-.7308738{col 106}{space 3}-.3959933
{txt}{space 1}Baccalaureat general franais des series L, ES, S  {c |}{col 53}{res}{space 2}-.5933644{col 65}{space 2} .0601451{col 76}{space 1}   -9.87{col 85}{space 3}0.000{col 93}{space 4}-.7113049{col 106}{space 3}-.4754239
{txt}{space 23}Certificat d'acces etranger  {c |}{col 53}{res}{space 2} .2544978{col 65}{space 2} .0592502{col 76}{space 1}    4.30{col 85}{space 3}0.000{col 93}{space 4}  .138312{col 106}{space 3} .3706836
{txt}Diplme de fin detudes secondaires, section B, C,  {c |}{col 53}{res}{space 2}-.2567393{col 65}{space 2} .1636909{col 76}{space 1}   -1.57{col 85}{space 3}0.117{col 93}{space 4}-.5777263{col 106}{space 3} .0642477
{txt}Maturite de la Commission suisse de maturite (CSM)  {c |}{col 53}{res}{space 2}-.3931105{col 65}{space 2} .0785534{col 76}{space 1}   -5.00{col 85}{space 3}0.000{col 93}{space 4}-.5471486{col 106}{space 3}-.2390725
{txt}{space 2}Maturite gymnasiale, option : Biologie et chimie  {c |}{col 53}{res}{space 2}-.2704036{col 65}{space 2} .0854397{col 76}{space 1}   -3.16{col 85}{space 3}0.002{col 93}{space 4}-.4379452{col 106}{space 3} -.102862
{txt}{space 6}Maturite gymnasiale, option : Langue moderne  {c |}{col 53}{res}{space 2}-.3142844{col 65}{space 2} .0952226{col 76}{space 1}   -3.30{col 85}{space 3}0.001{col 93}{space 4}-.5010096{col 106}{space 3}-.1275592
{txt}Maturite gymnasiale, option : Philosophie / pedago  {c |}{col 53}{res}{space 2}-.5162851{col 65}{space 2} .1579416{col 76}{space 1}   -3.27{col 85}{space 3}0.001{col 93}{space 4} -.825998{col 106}{space 3}-.2065722
{txt}Maturite gymnasiale, option : Physique et applicat  {c |}{col 53}{res}{space 2} .3768171{col 65}{space 2}   .06196{col 76}{space 1}    6.08{col 85}{space 3}0.000{col 93}{space 4} .2553177{col 106}{space 3} .4983165
{txt}Maturite professionnelle avec examen complementair  {c |}{col 53}{res}{space 2}-.2046379{col 65}{space 2} .1544183{col 76}{space 1}   -1.33{col 85}{space 3}0.185{col 93}{space 4} -.507442{col 106}{space 3} .0981661
{txt}Nouvelle maturite cant.gymnasiale rec. par Confed.  {c |}{col 53}{res}{space 2} .3871554{col 65}{space 2} .0441751{col 76}{space 1}    8.76{col 85}{space 3}0.000{col 93}{space 4}  .300531{col 106}{space 3} .4737799
{txt}{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2} 4.065899{col 65}{space 2} .0423644{col 76}{space 1}   95.97{col 85}{space 3}0.000{col 93}{space 4} 3.982825{col 106}{space 3} 4.148973
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using matu, label replace dec(3) tex(frag pr)
{txt}{stata `"shellout using `"matu.tex"'"':matu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "matu.txt", label"':seeout}

{com}.         global params "i.sexe ib(52).matu_nom ib(2010).debut" //eco
{txt}
{com}.         reg moyenne $params, robust

{txt}Linear regression                                      Number of obs ={res}    2460
                                                       {txt}F( 20,  2439) ={res}   93.31
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.3134
                                                       {txt}Root MSE      = {res} .77406

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                            moyenne{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      t{col 85}   P>|t|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2} .0170111{col 65}{space 2} .0338299{col 76}{space 1}    0.50{col 85}{space 3}0.615{col 93}{space 4}-.0493272{col 106}{space 3} .0833493
{txt}{space 51} {c |}
{space 43}matu_nom {c |}
{space 49}0  {c |}{col 53}{res}{space 2}-.4198335{col 65}{space 2} .0774513{col 76}{space 1}   -5.42{col 85}{space 3}0.000{col 93}{space 4}-.5717106{col 106}{space 3}-.2679563
{txt}{space 1}Baccalaureat general franais des series L, ES, S  {c |}{col 53}{res}{space 2}-.3942219{col 65}{space 2} .0573709{col 76}{space 1}   -6.87{col 85}{space 3}0.000{col 93}{space 4}-.5067226{col 106}{space 3}-.2817212
{txt}{space 23}Certificat d'acces etranger  {c |}{col 53}{res}{space 2}-.3185663{col 65}{space 2} .0640696{col 76}{space 1}   -4.97{col 85}{space 3}0.000{col 93}{space 4}-.4442027{col 106}{space 3}-.1929299
{txt}Diplme de fin detudes secondaires, section B, C,  {c |}{col 53}{res}{space 2}-.1958327{col 65}{space 2} .1651565{col 76}{space 1}   -1.19{col 85}{space 3}0.236{col 93}{space 4}-.5196941{col 106}{space 3} .1280287
{txt}Maturite de la Commission suisse de maturite (CSM)  {c |}{col 53}{res}{space 2}-.4737258{col 65}{space 2} .0717538{col 76}{space 1}   -6.60{col 85}{space 3}0.000{col 93}{space 4}-.6144306{col 106}{space 3}-.3330211
{txt}{space 2}Maturite gymnasiale, option : Biologie et chimie  {c |}{col 53}{res}{space 2}-.1950567{col 65}{space 2} .0790417{col 76}{space 1}   -2.47{col 85}{space 3}0.014{col 93}{space 4}-.3500526{col 106}{space 3}-.0400609
{txt}{space 6}Maturite gymnasiale, option : Langue moderne  {c |}{col 53}{res}{space 2}-.2204829{col 65}{space 2} .0839687{col 76}{space 1}   -2.63{col 85}{space 3}0.009{col 93}{space 4}-.3851403{col 106}{space 3}-.0558255
{txt}Maturite gymnasiale, option : Philosophie / pedago  {c |}{col 53}{res}{space 2}-.3714656{col 65}{space 2} .1181074{col 76}{space 1}   -3.15{col 85}{space 3}0.002{col 93}{space 4}-.6030667{col 106}{space 3}-.1398644
{txt}Maturite gymnasiale, option : Physique et applicat  {c |}{col 53}{res}{space 2} .3528391{col 65}{space 2} .0588596{col 76}{space 1}    5.99{col 85}{space 3}0.000{col 93}{space 4} .2374191{col 106}{space 3}  .468259
{txt}Maturite professionnelle avec examen complementair  {c |}{col 53}{res}{space 2} -.126277{col 65}{space 2} .1107201{col 76}{space 1}   -1.14{col 85}{space 3}0.254{col 93}{space 4}-.3433922{col 106}{space 3} .0908382
{txt}Nouvelle maturite cant.gymnasiale rec. par Confed.  {c |}{col 53}{res}{space 2}-.2355247{col 65}{space 2} .0613304{col 76}{space 1}   -3.84{col 85}{space 3}0.000{col 93}{space 4}-.3557898{col 106}{space 3}-.1152596
{txt}{space 51} {c |}
{space 46}debut {c |}
{space 46}2006  {c |}{col 53}{res}{space 2} .6027041{col 65}{space 2} .0678899{col 76}{space 1}    8.88{col 85}{space 3}0.000{col 93}{space 4} .4695763{col 106}{space 3} .7358319
{txt}{space 46}2007  {c |}{col 53}{res}{space 2} .7512749{col 65}{space 2}  .067003{col 76}{space 1}   11.21{col 85}{space 3}0.000{col 93}{space 4} .6198862{col 106}{space 3} .8826635
{txt}{space 46}2008  {c |}{col 53}{res}{space 2} .5277487{col 65}{space 2} .0545066{col 76}{space 1}    9.68{col 85}{space 3}0.000{col 93}{space 4} .4208647{col 106}{space 3} .6346328
{txt}{space 46}2009  {c |}{col 53}{res}{space 2} .0066039{col 65}{space 2} .0580469{col 76}{space 1}    0.11{col 85}{space 3}0.909{col 93}{space 4}-.1072224{col 106}{space 3} .1204302
{txt}{space 46}2011  {c |}{col 53}{res}{space 2}-.0321336{col 65}{space 2} .0601166{col 76}{space 1}   -0.53{col 85}{space 3}0.593{col 93}{space 4}-.1500185{col 106}{space 3} .0857513
{txt}{space 46}2012  {c |}{col 53}{res}{space 2}-.8134212{col 65}{space 2} .0622008{col 76}{space 1}  -13.08{col 85}{space 3}0.000{col 93}{space 4}-.9353931{col 106}{space 3}-.6914493
{txt}{space 46}2013  {c |}{col 53}{res}{space 2}-1.058579{col 65}{space 2} .0815199{col 76}{space 1}  -12.99{col 85}{space 3}0.000{col 93}{space 4}-1.218434{col 106}{space 3}-.8987237
{txt}{space 46}2014  {c |}{col 53}{res}{space 2}-.9084986{col 65}{space 2} .1640377{col 76}{space 1}   -5.54{col 85}{space 3}0.000{col 93}{space 4}-1.230166{col 106}{space 3} -.586831
{txt}{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2} 4.100059{col 65}{space 2} .0516578{col 76}{space 1}   79.37{col 85}{space 3}0.000{col 93}{space 4} 3.998761{col 106}{space 3} 4.201356
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using matu, label append dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"matu.tex"'"':matu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "matu.txt", label"':seeout}

{com}.         global params "i.sexe ib(52).matu_nom" //eco
{txt}
{com}.         reg moyenne $params if etat == 3, robust 

{txt}Linear regression                                      Number of obs ={res}    1451
                                                       {txt}F( 12,  1438) ={res}    2.99
                                                       {txt}Prob > F      = {res} 0.0004
                                                       {txt}R-squared     = {res} 0.0311
                                                       {txt}Root MSE      = {res} .34601

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                            moyenne{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      t{col 85}   P>|t|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2}-.0030814{col 65}{space 2} .0194584{col 76}{space 1}   -0.16{col 85}{space 3}0.874{col 93}{space 4}-.0412513{col 106}{space 3} .0350886
{txt}{space 51} {c |}
{space 43}matu_nom {c |}
{space 49}0  {c |}{col 53}{res}{space 2} .0015759{col 65}{space 2}  .043161{col 76}{space 1}    0.04{col 85}{space 3}0.971{col 93}{space 4}-.0830894{col 106}{space 3} .0862412
{txt}{space 1}Baccalaureat general franais des series L, ES, S  {c |}{col 53}{res}{space 2}-.0169506{col 65}{space 2}  .034771{col 76}{space 1}   -0.49{col 85}{space 3}0.626{col 93}{space 4}-.0851579{col 106}{space 3} .0512567
{txt}{space 23}Certificat d'acces etranger  {c |}{col 53}{res}{space 2}-.0059655{col 65}{space 2}  .034079{col 76}{space 1}   -0.18{col 85}{space 3}0.861{col 93}{space 4}-.0728155{col 106}{space 3} .0608844
{txt}Diplme de fin detudes secondaires, section B, C,  {c |}{col 53}{res}{space 2} .0021762{col 65}{space 2} .0663361{col 76}{space 1}    0.03{col 85}{space 3}0.974{col 93}{space 4}-.1279496{col 106}{space 3} .1323021
{txt}Maturite de la Commission suisse de maturite (CSM)  {c |}{col 53}{res}{space 2}-.0673542{col 65}{space 2} .0380659{col 76}{space 1}   -1.77{col 85}{space 3}0.077{col 93}{space 4}-.1420248{col 106}{space 3} .0073164
{txt}{space 2}Maturite gymnasiale, option : Biologie et chimie  {c |}{col 53}{res}{space 2}-.0755962{col 65}{space 2} .0448775{col 76}{space 1}   -1.68{col 85}{space 3}0.092{col 93}{space 4}-.1636286{col 106}{space 3} .0124362
{txt}{space 6}Maturite gymnasiale, option : Langue moderne  {c |}{col 53}{res}{space 2} .0371122{col 65}{space 2} .0495738{col 76}{space 1}    0.75{col 85}{space 3}0.454{col 93}{space 4}-.0601325{col 106}{space 3}  .134357
{txt}Maturite gymnasiale, option : Philosophie / pedago  {c |}{col 53}{res}{space 2}-.0675427{col 65}{space 2} .0647403{col 76}{space 1}   -1.04{col 85}{space 3}0.297{col 93}{space 4}-.1945384{col 106}{space 3} .0594529
{txt}Maturite gymnasiale, option : Physique et applicat  {c |}{col 53}{res}{space 2} .1813406{col 65}{space 2} .0400889{col 76}{space 1}    4.52{col 85}{space 3}0.000{col 93}{space 4} .1027016{col 106}{space 3} .2599795
{txt}Maturite professionnelle avec examen complementair  {c |}{col 53}{res}{space 2}-.0747088{col 65}{space 2} .0852737{col 76}{space 1}   -0.88{col 85}{space 3}0.381{col 93}{space 4} -.241983{col 106}{space 3} .0925654
{txt}Nouvelle maturite cant.gymnasiale rec. par Confed.  {c |}{col 53}{res}{space 2} .0077719{col 65}{space 2} .0255292{col 76}{space 1}    0.30{col 85}{space 3}0.761{col 93}{space 4}-.0423065{col 106}{space 3} .0578502
{txt}{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2}  4.58031{col 65}{space 2} .0223829{col 76}{space 1}  204.63{col 85}{space 3}0.000{col 93}{space 4} 4.536403{col 106}{space 3} 4.624216
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using matu, label append dec(3) tex(frag pr)
{txt}{stata `"shellout using `"matu.tex"'"':matu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "matu.txt", label"':seeout}

{com}.         global params "i.sexe ib(52).matu_nom ib(2010).debut" //eco
{txt}
{com}.         eststo clear
{txt}
{com}.         eststo: reg moyenne $params if etat == 3, robust

{txt}Linear regression                                      Number of obs ={res}    1451
                                                       {txt}F( 17,  1433) ={res}    4.79
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0469
                                                       {txt}Root MSE      = {res} .34376

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                            moyenne{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      t{col 85}   P>|t|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2}-.0016553{col 65}{space 2} .0193821{col 76}{space 1}   -0.09{col 85}{space 3}0.932{col 93}{space 4}-.0396757{col 106}{space 3}  .036365
{txt}{space 51} {c |}
{space 43}matu_nom {c |}
{space 49}0  {c |}{col 53}{res}{space 2} .0136278{col 65}{space 2} .0420605{col 76}{space 1}    0.32{col 85}{space 3}0.746{col 93}{space 4}-.0688789{col 106}{space 3} .0961346
{txt}{space 1}Baccalaureat general franais des series L, ES, S  {c |}{col 53}{res}{space 2} -.018969{col 65}{space 2} .0349251{col 76}{space 1}   -0.54{col 85}{space 3}0.587{col 93}{space 4}-.0874789{col 106}{space 3} .0495408
{txt}{space 23}Certificat d'acces etranger  {c |}{col 53}{res}{space 2} .0363867{col 65}{space 2} .0409043{col 76}{space 1}    0.89{col 85}{space 3}0.374{col 93}{space 4}-.0438521{col 106}{space 3} .1166255
{txt}Diplme de fin detudes secondaires, section B, C,  {c |}{col 53}{res}{space 2} -.011635{col 65}{space 2} .0664482{col 76}{space 1}   -0.18{col 85}{space 3}0.861{col 93}{space 4}-.1419812{col 106}{space 3} .1187112
{txt}Maturite de la Commission suisse de maturite (CSM)  {c |}{col 53}{res}{space 2}-.0513712{col 65}{space 2}  .039298{col 76}{space 1}   -1.31{col 85}{space 3}0.191{col 93}{space 4}-.1284589{col 106}{space 3} .0257165
{txt}{space 2}Maturite gymnasiale, option : Biologie et chimie  {c |}{col 53}{res}{space 2}-.0752536{col 65}{space 2} .0449121{col 76}{space 1}   -1.68{col 85}{space 3}0.094{col 93}{space 4}-.1633541{col 106}{space 3} .0128469
{txt}{space 6}Maturite gymnasiale, option : Langue moderne  {c |}{col 53}{res}{space 2} .0370057{col 65}{space 2} .0504543{col 76}{space 1}    0.73{col 85}{space 3}0.463{col 93}{space 4}-.0619666{col 106}{space 3} .1359779
{txt}Maturite gymnasiale, option : Philosophie / pedago  {c |}{col 53}{res}{space 2}-.0707234{col 65}{space 2} .0634336{col 76}{space 1}   -1.11{col 85}{space 3}0.265{col 93}{space 4} -.195156{col 106}{space 3} .0537091
{txt}Maturite gymnasiale, option : Physique et applicat  {c |}{col 53}{res}{space 2} .1756142{col 65}{space 2} .0407242{col 76}{space 1}    4.31{col 85}{space 3}0.000{col 93}{space 4} .0957287{col 106}{space 3} .2554997
{txt}Maturite professionnelle avec examen complementair  {c |}{col 53}{res}{space 2}-.0709149{col 65}{space 2} .0844632{col 76}{space 1}   -0.84{col 85}{space 3}0.401{col 93}{space 4}-.2365996{col 106}{space 3} .0947698
{txt}Nouvelle maturite cant.gymnasiale rec. par Confed.  {c |}{col 53}{res}{space 2}  .071917{col 65}{space 2} .0370231{col 76}{space 1}    1.94{col 85}{space 3}0.052{col 93}{space 4}-.0007083{col 106}{space 3} .1445423
{txt}{space 51} {c |}
{space 46}debut {c |}
{space 46}2006  {c |}{col 53}{res}{space 2}-.1679323{col 65}{space 2} .0401285{col 76}{space 1}   -4.18{col 85}{space 3}0.000{col 93}{space 4}-.2466491{col 106}{space 3}-.0892155
{txt}{space 46}2007  {c |}{col 53}{res}{space 2}-.0284149{col 65}{space 2} .0402639{col 76}{space 1}   -0.71{col 85}{space 3}0.480{col 93}{space 4}-.1073974{col 106}{space 3} .0505675
{txt}{space 46}2008  {c |}{col 53}{res}{space 2}-.0021681{col 65}{space 2}   .03157{col 76}{space 1}   -0.07{col 85}{space 3}0.945{col 93}{space 4}-.0640965{col 106}{space 3} .0597602
{txt}{space 46}2009  {c |}{col 53}{res}{space 2}-.0205188{col 65}{space 2} .0295476{col 76}{space 1}   -0.69{col 85}{space 3}0.488{col 93}{space 4}-.0784799{col 106}{space 3} .0374424
{txt}{space 46}2011  {c |}{col 53}{res}{space 2} .0610837{col 65}{space 2} .0297298{col 76}{space 1}    2.05{col 85}{space 3}0.040{col 93}{space 4} .0027651{col 106}{space 3} .1194023
{txt}{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2} 4.572825{col 65}{space 2} .0265992{col 76}{space 1}  171.92{col 85}{space 3}0.000{col 93}{space 4} 4.520648{col 106}{space 3} 4.625003
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}.         outreg2 using matu, label append dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"matu.tex"'"':matu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "matu.txt", label"':seeout}

{com}.         esttab using matu.csv, replace wide plain se label
{res}{txt}(output written to {browse  `"matu.csv"'})

{com}. 
.         logit fini $params , robust

{txt}note: 2012.debut != 0 predicts failure perfectly
      2012.debut dropped and 220 obs not used

note: 2013.debut != 0 predicts failure perfectly
      2013.debut dropped and 104 obs not used

note: 2014.debut != 0 predicts failure perfectly
      2014.debut dropped and 15 obs not used

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-1322.9347}  
Iteration 1:{space 3}log pseudolikelihood = {res:-1130.6915}  
Iteration 2:{space 3}log pseudolikelihood = {res:-1114.3264}  
Iteration 3:{space 3}log pseudolikelihood = {res:-1113.4345}  
Iteration 4:{space 3}log pseudolikelihood = {res:-1113.4318}  
Iteration 5:{space 3}log pseudolikelihood = {res:-1113.4318}  
{res}
{txt}Logistic regression{col 51}Number of obs{col 67}= {res}      2121
{txt}{col 51}Wald chi2({res}17{txt}){col 67}= {res}    254.44
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log pseudolikelihood = {res}-1113.4318{txt}{col 51}Pseudo R2{col 67}= {res}    0.1584

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                               fini{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      z{col 85}   P>|z|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2} .1027964{col 65}{space 2} .1112236{col 76}{space 1}    0.92{col 85}{space 3}0.355{col 93}{space 4}-.1151979{col 106}{space 3} .3207906
{txt}{space 51} {c |}
{space 43}matu_nom {c |}
{space 49}0  {c |}{col 53}{res}{space 2} -.804169{col 65}{space 2} .2096284{col 76}{space 1}   -3.84{col 85}{space 3}0.000{col 93}{space 4}-1.215033{col 106}{space 3}-.3933049
{txt}{space 1}Baccalaureat general franais des series L, ES, S  {c |}{col 53}{res}{space 2}-.9307805{col 65}{space 2} .1543876{col 76}{space 1}   -6.03{col 85}{space 3}0.000{col 93}{space 4}-1.233375{col 106}{space 3}-.6281864
{txt}{space 23}Certificat d'acces etranger  {c |}{col 53}{res}{space 2}-1.301374{col 65}{space 2} .2600052{col 76}{space 1}   -5.01{col 85}{space 3}0.000{col 93}{space 4}-1.810975{col 106}{space 3}-.7917737
{txt}Diplme de fin detudes secondaires, section B, C,  {c |}{col 53}{res}{space 2}-.3974864{col 65}{space 2} .3881696{col 76}{space 1}   -1.02{col 85}{space 3}0.306{col 93}{space 4}-1.158285{col 106}{space 3} .3633121
{txt}Maturite de la Commission suisse de maturite (CSM)  {c |}{col 53}{res}{space 2}-1.104119{col 65}{space 2} .1981539{col 76}{space 1}   -5.57{col 85}{space 3}0.000{col 93}{space 4}-1.492494{col 106}{space 3}-.7157447
{txt}{space 2}Maturite gymnasiale, option : Biologie et chimie  {c |}{col 53}{res}{space 2}-.4134875{col 65}{space 2} .2161281{col 76}{space 1}   -1.91{col 85}{space 3}0.056{col 93}{space 4}-.8370907{col 106}{space 3} .0101158
{txt}{space 6}Maturite gymnasiale, option : Langue moderne  {c |}{col 53}{res}{space 2}-.6042318{col 65}{space 2} .2433541{col 76}{space 1}   -2.48{col 85}{space 3}0.013{col 93}{space 4}-1.081197{col 106}{space 3}-.1272666
{txt}Maturite gymnasiale, option : Philosophie / pedago  {c |}{col 53}{res}{space 2}-.7639941{col 65}{space 2} .4852243{col 76}{space 1}   -1.57{col 85}{space 3}0.115{col 93}{space 4}-1.715016{col 106}{space 3} .1870281
{txt}Maturite gymnasiale, option : Physique et applicat  {c |}{col 53}{res}{space 2} .5452991{col 65}{space 2} .2268123{col 76}{space 1}    2.40{col 85}{space 3}0.016{col 93}{space 4} .1007551{col 106}{space 3}  .989843
{txt}Maturite professionnelle avec examen complementair  {c |}{col 53}{res}{space 2}  .160712{col 65}{space 2} .4794467{col 76}{space 1}    0.34{col 85}{space 3}0.737{col 93}{space 4}-.7789862{col 106}{space 3}  1.10041
{txt}Nouvelle maturite cant.gymnasiale rec. par Confed.  {c |}{col 53}{res}{space 2}-.8783849{col 65}{space 2} .2525917{col 76}{space 1}   -3.48{col 85}{space 3}0.001{col 93}{space 4}-1.373456{col 106}{space 3}-.3833142
{txt}{space 51} {c |}
{space 46}debut {c |}
{space 46}2006  {c |}{col 53}{res}{space 2} 3.677076{col 65}{space 2} .6327165{col 76}{space 1}    5.81{col 85}{space 3}0.000{col 93}{space 4} 2.436975{col 106}{space 3} 4.917178
{txt}{space 46}2007  {c |}{col 53}{res}{space 2} 3.739222{col 65}{space 2} .4284511{col 76}{space 1}    8.73{col 85}{space 3}0.000{col 93}{space 4} 2.899473{col 106}{space 3}  4.57897
{txt}{space 46}2008  {c |}{col 53}{res}{space 2} 1.463341{col 65}{space 2} .2153845{col 76}{space 1}    6.79{col 85}{space 3}0.000{col 93}{space 4} 1.041195{col 106}{space 3} 1.885487
{txt}{space 46}2009  {c |}{col 53}{res}{space 2} .0695505{col 65}{space 2}   .13646{col 76}{space 1}    0.51{col 85}{space 3}0.610{col 93}{space 4}-.1979063{col 106}{space 3} .3370072
{txt}{space 46}2011  {c |}{col 53}{res}{space 2}-.3347069{col 65}{space 2} .1350928{col 76}{space 1}   -2.48{col 85}{space 3}0.013{col 93}{space 4} -.599484{col 106}{space 3}-.0699299
{txt}{space 46}2012  {c |}{col 53}{res}{space 2}        0{col 65}{txt}  (empty)
{space 46}2013  {c |}{col 53}{res}{space 2}        0{col 65}{txt}  (empty)
{space 46}2014  {c |}{col 53}{res}{space 2}        0{col 65}{txt}  (empty)
{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2} .7799013{col 65}{space 2} .1471191{col 76}{space 1}    5.30{col 85}{space 3}0.000{col 93}{space 4} .4915531{col 106}{space 3} 1.068249
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.         outreg2 using matuLogit, label replace dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"matuLogit.tex"'"':matuLogit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "matuLogit.txt", label"':seeout}

{com}.         margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 51}Number of obs{col 67}= {res}      2121
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(fini), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.sexe 0.matu_nom 12.matu_nom 27.matu_nom 37.matu_nom 48.matu_nom 51.matu_nom 53.matu_nom 55.matu_nom 56.matu_nom 58.matu_nom 60.matu_nom 2006.debut 2007.debut 2008.debut 2009.debut 2011.debut 2012.debut 2013.debut 2014.debut}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.sexe}{space 10}{txt:=} {space 4}.349835 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.sexe}{space 10}{txt:=} {space 4}.650165 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.matu_nom}{space 6}{txt:=} {space 3}.0669496 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:12.matu_nom}{space 5}{txt:=} {space 3}.1409712 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:27.matu_nom}{space 5}{txt:=} {space 3}.0905233 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:37.matu_nom}{space 5}{txt:=} {space 3}.0150872 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:48.matu_nom}{space 5}{txt:=} {space 3}.0801509 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:51.matu_nom}{space 5}{txt:=} {space 3}.0556341 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:52.matu_nom}{space 5}{txt:=} {space 3}.2432815 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:53.matu_nom}{space 5}{txt:=} {space 3}.0443187 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:55.matu_nom}{space 5}{txt:=} {space 3}.0117869 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:56.matu_nom}{space 5}{txt:=} {space 3}.0792079 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:58.matu_nom}{space 5}{txt:=} {space 3}.0122584 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:60.matu_nom}{space 5}{txt:=} {space 3}.1598303 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2006.debut}{space 6}{txt:=} {space 3}.0504479 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2007.debut}{space 6}{txt:=} {space 3}.1202263 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2008.debut}{space 6}{txt:=} {space 3}.1532296 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2009.debut}{space 6}{txt:=} {space 3}.2206506 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2010.debut}{space 6}{txt:=} {space 3}.2545969 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2011.debut}{space 6}{txt:=} {space 3}.2008487 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65} Delta-method
{col 53}{c |}      dy/dx{col 65}   Std. Err.{col 77}      z{col 85}   P>|z|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2} .0193817{col 65}{space 2} .0212177{col 76}{space 1}    0.91{col 85}{space 3}0.361{col 93}{space 4}-.0222042{col 106}{space 3} .0609677
{txt}{space 51} {c |}
{space 43}matu_nom {c |}
{space 49}0  {c |}{col 53}{res}{space 2}-.1388889{col 65}{space 2} .0409621{col 76}{space 1}   -3.39{col 85}{space 3}0.001{col 93}{space 4}-.2191732{col 106}{space 3}-.0586047
{txt}{space 1}Baccalaureat general franais des series L, ES, S  {c |}{col 53}{res}{space 2}-.1661036{col 65}{space 2} .0299731{col 76}{space 1}   -5.54{col 85}{space 3}0.000{col 93}{space 4}-.2248498{col 106}{space 3}-.1073575
{txt}{space 23}Certificat d'acces etranger  {c |}{col 53}{res}{space 2} -.252162{col 65}{space 2} .0561253{col 76}{space 1}   -4.49{col 85}{space 3}0.000{col 93}{space 4}-.3621656{col 106}{space 3}-.1421584
{txt}Diplme de fin detudes secondaires, section B, C,  {c |}{col 53}{res}{space 2}-.0610004{col 65}{space 2} .0661524{col 76}{space 1}   -0.92{col 85}{space 3}0.356{col 93}{space 4}-.1906567{col 106}{space 3} .0686559
{txt}Maturite de la Commission suisse de maturite (CSM)  {c |}{col 53}{res}{space 2}-.2053096{col 65}{space 2}  .042223{col 76}{space 1}   -4.86{col 85}{space 3}0.000{col 93}{space 4}-.2880651{col 106}{space 3}-.1225541
{txt}{space 2}Maturite gymnasiale, option : Biologie et chimie  {c |}{col 53}{res}{space 2}-.0637723{col 65}{space 2} .0359874{col 76}{space 1}   -1.77{col 85}{space 3}0.076{col 93}{space 4}-.1343064{col 106}{space 3} .0067617
{txt}{space 6}Maturite gymnasiale, option : Langue moderne  {c |}{col 53}{res}{space 2}-.0986927{col 65}{space 2} .0446776{col 76}{space 1}   -2.21{col 85}{space 3}0.027{col 93}{space 4}-.1862591{col 106}{space 3}-.0111263
{txt}Maturite gymnasiale, option : Philosophie / pedago  {c |}{col 53}{res}{space 2}-.1305297{col 65}{space 2} .0988785{col 76}{space 1}   -1.32{col 85}{space 3}0.187{col 93}{space 4}-.3243281{col 106}{space 3} .0632687
{txt}Maturite gymnasiale, option : Physique et applicat  {c |}{col 53}{res}{space 2} .0607494{col 65}{space 2} .0229686{col 76}{space 1}    2.64{col 85}{space 3}0.008{col 93}{space 4} .0157318{col 106}{space 3} .1057671
{txt}Maturite professionnelle avec examen complementair  {c |}{col 53}{res}{space 2} .0204975{col 65}{space 2}  .058093{col 76}{space 1}    0.35{col 85}{space 3}0.724{col 93}{space 4}-.0933626{col 106}{space 3} .1343576
{txt}Nouvelle maturite cant.gymnasiale rec. par Confed.  {c |}{col 53}{res}{space 2}-.1546855{col 65}{space 2} .0492539{col 76}{space 1}   -3.14{col 85}{space 3}0.002{col 93}{space 4}-.2512214{col 106}{space 3}-.0581496
{txt}{space 51} {c |}
{space 46}debut {c |}
{space 46}2006  {c |}{col 53}{res}{space 2} .4082108{col 65}{space 2} .0288836{col 76}{space 1}   14.13{col 85}{space 3}0.000{col 93}{space 4}    .3516{col 106}{space 3} .4648217
{txt}{space 46}2007  {c |}{col 53}{res}{space 2} .4093049{col 65}{space 2} .0270473{col 76}{space 1}   15.13{col 85}{space 3}0.000{col 93}{space 4} .3562932{col 106}{space 3} .4623167
{txt}{space 46}2008  {c |}{col 53}{res}{space 2} .2797381{col 65}{space 2} .0359577{col 76}{space 1}    7.78{col 85}{space 3}0.000{col 93}{space 4} .2092622{col 106}{space 3}  .350214
{txt}{space 46}2009  {c |}{col 53}{res}{space 2} .0169207{col 65}{space 2} .0331949{col 76}{space 1}    0.51{col 85}{space 3}0.610{col 93}{space 4}-.0481401{col 106}{space 3} .0819816
{txt}{space 46}2011  {c |}{col 53}{res}{space 2}-.0831433{col 65}{space 2} .0334293{col 76}{space 1}   -2.49{col 85}{space 3}0.013{col 93}{space 4}-.1486635{col 106}{space 3} -.017623
{txt}{space 46}2012  {c |}{col 53}{res}{space 2}        .{col 65}{txt}  (not estimable)
{space 46}2013  {c |}{col 53}{res}{space 2}        .{col 65}{txt}  (not estimable)
{space 46}2014  {c |}{col 53}{res}{space 2}        .{col 65}{txt}  (not estimable)
{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 117}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}.         outreg2 using matuLogit, label append dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"matuLogit.tex"'"':matuLogit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "matuLogit.txt", label"':seeout}

{com}. 
.         
.         global params "i.sexe ib(51).matu_lieu" //Suisse
{txt}
{com}.         reg moyenne $params , robust 

{txt}Linear regression                                      Number of obs ={res}    2460
                                                       {txt}F(  5,  2454) ={res}   20.84
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0463
                                                       {txt}Root MSE      = {res} .90949

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     moyenne{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0524452{col 26}{space 2} .0387275{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-.0234968{col 67}{space 3} .1283873
{txt}{space 12} {c |}
{space 3}matu_lieu {c |}
{space 10}0  {c |}{col 14}{res}{space 2}-.4789252{col 26}{space 2}  .084446{col 37}{space 1}   -5.67{col 46}{space 3}0.000{col 54}{space 4} -.644518{col 67}{space 3}-.3133324
{txt}{space 5}France  {c |}{col 14}{res}{space 2} -.250126{col 26}{space 2} .0535532{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4}-.3551402{col 67}{space 3}-.1451119
{txt}{space 1}Luxembourg  {c |}{col 14}{res}{space 2} -.135693{col 26}{space 2} .1373586{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-.4050438{col 67}{space 3} .1336577
{txt}{space 6}Maroc  {c |}{col 14}{res}{space 2}-.9444612{col 26}{space 2} .1249474{col 37}{space 1}   -7.56{col 46}{space 3}0.000{col 54}{space 4}-1.189474{col 67}{space 3} -.699448
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.021474{col 26}{space 2} .0333015{col 37}{space 1}  120.76{col 46}{space 3}0.000{col 54}{space 4} 3.956172{col 67}{space 3} 4.086776
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using lieu, label replace dec(3) tex(frag pr) 
{txt}{stata `"shellout using `"lieu.tex"'"':lieu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "lieu.txt", label"':seeout}

{com}.         global params "i.sexe ib(51).matu_lieu ib(2010).debut" //Suisse
{txt}
{com}.         reg moyenne $params, robust 

{txt}Linear regression                                      Number of obs ={res}    2460
                                                       {txt}F( 13,  2446) ={res}  130.20
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2769
                                                       {txt}Root MSE      = {res}  .7932

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     moyenne{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0480562{col 26}{space 2} .0339461{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4}-.0185098{col 67}{space 3} .1146222
{txt}{space 12} {c |}
{space 3}matu_lieu {c |}
{space 10}0  {c |}{col 14}{res}{space 2}-.3113907{col 26}{space 2} .0718379{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.4522602{col 67}{space 3}-.1705212
{txt}{space 5}France  {c |}{col 14}{res}{space 2}-.1433916{col 26}{space 2} .0458778{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4} -.233355{col 67}{space 3}-.0534283
{txt}{space 1}Luxembourg  {c |}{col 14}{res}{space 2}-.1176001{col 26}{space 2} .1326067{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-.3776331{col 67}{space 3} .1424328
{txt}{space 6}Maroc  {c |}{col 14}{res}{space 2}-.6273365{col 26}{space 2} .1155791{col 37}{space 1}   -5.43{col 46}{space 3}0.000{col 54}{space 4}-.8539794{col 67}{space 3}-.4006935
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .4970877{col 26}{space 2} .0463752{col 37}{space 1}   10.72{col 46}{space 3}0.000{col 54}{space 4} .4061489{col 67}{space 3} .5880264
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .6285906{col 26}{space 2} .0469288{col 37}{space 1}   13.39{col 46}{space 3}0.000{col 54}{space 4} .5365663{col 67}{space 3} .7206148
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .5115662{col 26}{space 2} .0491971{col 37}{space 1}   10.40{col 46}{space 3}0.000{col 54}{space 4} .4150939{col 67}{space 3} .6080386
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0214608{col 26}{space 2} .0588268{col 37}{space 1}    0.36{col 46}{space 3}0.715{col 54}{space 4}-.0938947{col 67}{space 3} .1368163
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0312105{col 26}{space 2} .0615529{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 54}{space 4}-.1519117{col 67}{space 3} .0894907
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.8548686{col 26}{space 2} .0626183{col 37}{space 1}  -13.65{col 46}{space 3}0.000{col 54}{space 4} -.977659{col 67}{space 3}-.7320782
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-1.069371{col 26}{space 2} .0817922{col 37}{space 1}  -13.07{col 46}{space 3}0.000{col 54}{space 4} -1.22976{col 67}{space 3}-.9089816
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.8985264{col 26}{space 2} .1781979{col 37}{space 1}   -5.04{col 46}{space 3}0.000{col 54}{space 4}-1.247961{col 67}{space 3}-.5490921
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.962636{col 26}{space 2}  .047221{col 37}{space 1}   83.92{col 46}{space 3}0.000{col 54}{space 4} 3.870039{col 67}{space 3} 4.055234
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using lieu, label append dec(3) tex(frag pr) drop(ib(2010).debut)
{txt}{stata `"shellout using `"lieu.tex"'"':lieu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "lieu.txt", label"':seeout}

{com}.         global params "i.sexe ib(51).matu_lieu" //Suisse
{txt}
{com}.         
.         reg moyenne $params if etat == 3, robust 

{txt}Linear regression                                      Number of obs ={res}    1451
                                                       {txt}F(  5,  1445) ={res}    0.84
                                                       {txt}Prob > F      = {res} 0.5207
                                                       {txt}R-squared     = {res} 0.0025
                                                       {txt}Root MSE      = {res} .35021

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     moyenne{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0040997{col 26}{space 2} .0193255{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-.0338094{col 67}{space 3} .0420088
{txt}{space 12} {c |}
{space 3}matu_lieu {c |}
{space 10}0  {c |}{col 14}{res}{space 2}-.0200963{col 26}{space 2} .0380156{col 37}{space 1}   -0.53{col 46}{space 3}0.597{col 54}{space 4}-.0946679{col 67}{space 3} .0544754
{txt}{space 5}France  {c |}{col 14}{res}{space 2}-.0290204{col 26}{space 2} .0285904{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-.0851035{col 67}{space 3} .0270627
{txt}{space 1}Luxembourg  {c |}{col 14}{res}{space 2}-.0036299{col 26}{space 2} .0554835{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-.1124667{col 67}{space 3}  .105207
{txt}{space 6}Maroc  {c |}{col 14}{res}{space 2}-.1664714{col 26}{space 2} .0963557{col 37}{space 1}   -1.73{col 46}{space 3}0.084{col 54}{space 4}-.3554834{col 67}{space 3} .0225405
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.589505{col 26}{space 2} .0165923{col 37}{space 1}  276.60{col 46}{space 3}0.000{col 54}{space 4} 4.556958{col 67}{space 3} 4.622053
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using lieu, label append dec(3) tex(frag pr) 
{txt}{stata `"shellout using `"lieu.tex"'"':lieu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "lieu.txt", label"':seeout}

{com}.         global params "i.sexe ib(51).matu_lieu ib(2010).debut" //Suisse
{txt}
{com}.         eststo clear
{txt}
{com}.         eststo: reg moyenne $params if etat == 3, robust 

{txt}Linear regression                                      Number of obs ={res}    1451
                                                       {txt}F( 10,  1440) ={res}    4.92
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0182
                                                       {txt}Root MSE      = {res} .34806

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     moyenne{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0064101{col 26}{space 2} .0192571{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4}-.0313648{col 67}{space 3}  .044185
{txt}{space 12} {c |}
{space 3}matu_lieu {c |}
{space 10}0  {c |}{col 14}{res}{space 2}-.0186654{col 26}{space 2} .0369759{col 37}{space 1}   -0.50{col 46}{space 3}0.614{col 54}{space 4}-.0911979{col 67}{space 3} .0538671
{txt}{space 5}France  {c |}{col 14}{res}{space 2}-.0305454{col 26}{space 2} .0283811{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-.0862182{col 67}{space 3} .0251274
{txt}{space 1}Luxembourg  {c |}{col 14}{res}{space 2}-.0170556{col 26}{space 2} .0558074{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.1265282{col 67}{space 3} .0924169
{txt}{space 6}Maroc  {c |}{col 14}{res}{space 2}-.1410212{col 26}{space 2} .0950509{col 37}{space 1}   -1.48{col 46}{space 3}0.138{col 54}{space 4}-.3274743{col 67}{space 3} .0454319
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2}-.1174844{col 26}{space 2} .0278933{col 37}{space 1}   -4.21{col 46}{space 3}0.000{col 54}{space 4}-.1722004{col 67}{space 3}-.0627685
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .0146902{col 26}{space 2} .0291981{col 37}{space 1}    0.50{col 46}{space 3}0.615{col 54}{space 4}-.0425851{col 67}{space 3} .0719655
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .0185888{col 26}{space 2} .0289808{col 37}{space 1}    0.64{col 46}{space 3}0.521{col 54}{space 4}-.0382603{col 67}{space 3}  .075438
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}  -.00869{col 26}{space 2} .0300855{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-.0677061{col 67}{space 3} .0503261
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .0755779{col 26}{space 2} .0298983{col 37}{space 1}    2.53{col 46}{space 3}0.012{col 54}{space 4}  .016929{col 67}{space 3} .1342268
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.580795{col 26}{space 2} .0238881{col 37}{space 1}  191.76{col 46}{space 3}0.000{col 54}{space 4} 4.533936{col 67}{space 3} 4.627654
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}({res}est1{txt} stored)

{com}.         outreg2 using lieu, label append dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"lieu.tex"'"':lieu.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "lieu.txt", label"':seeout}

{com}.         esttab using pays.csv, replace wide plain se label
{res}{txt}(output written to {browse  `"pays.csv"'})

{com}.         
.         logit fini $params , robust 

{txt}note: 2012.debut != 0 predicts failure perfectly
      2012.debut dropped and 220 obs not used

note: 2013.debut != 0 predicts failure perfectly
      2013.debut dropped and 104 obs not used

note: 2014.debut != 0 predicts failure perfectly
      2014.debut dropped and 15 obs not used

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-1322.9347}  
Iteration 1:{space 3}log pseudolikelihood = {res:-1157.1574}  
Iteration 2:{space 3}log pseudolikelihood = {res: -1141.872}  
Iteration 3:{space 3}log pseudolikelihood = {res:-1141.2842}  
Iteration 4:{space 3}log pseudolikelihood = {res:-1141.2812}  
Iteration 5:{space 3}log pseudolikelihood = {res:-1141.2812}  
{res}
{txt}Logistic regression{col 51}Number of obs{col 67}= {res}      2121
{txt}{col 51}Wald chi2({res}10{txt}){col 67}= {res}    205.01
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log pseudolikelihood = {res}-1141.2812{txt}{col 51}Pseudo R2{col 67}= {res}    0.1373

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        fini{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .1551296{col 26}{space 2} .1073159{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.0552058{col 67}{space 3} .3654649
{txt}{space 12} {c |}
{space 3}matu_lieu {c |}
{space 10}0  {c |}{col 14}{res}{space 2}-.6147423{col 26}{space 2}  .198118{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-1.003047{col 67}{space 3}-.2264381
{txt}{space 5}France  {c |}{col 14}{res}{space 2}-.4825964{col 26}{space 2}  .141773{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.7604664{col 67}{space 3}-.2047263
{txt}{space 1}Luxembourg  {c |}{col 14}{res}{space 2}-.1240772{col 26}{space 2}  .340579{col 37}{space 1}   -0.36{col 46}{space 3}0.716{col 54}{space 4}-.7915998{col 67}{space 3} .5434455
{txt}{space 6}Maroc  {c |}{col 14}{res}{space 2}-2.075033{col 26}{space 2}  .423111{col 37}{space 1}   -4.90{col 46}{space 3}0.000{col 54}{space 4}-2.904315{col 67}{space 3}-1.245751
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} 3.229389{col 26}{space 2} .5805147{col 37}{space 1}    5.56{col 46}{space 3}0.000{col 54}{space 4} 2.091601{col 67}{space 3} 4.367177
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}   3.1776{col 26}{space 2} .3981096{col 37}{space 1}    7.98{col 46}{space 3}0.000{col 54}{space 4} 2.397319{col 67}{space 3}  3.95788
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} 1.156439{col 26}{space 2} .1728817{col 37}{space 1}    6.69{col 46}{space 3}0.000{col 54}{space 4} .8175972{col 67}{space 3} 1.495281
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .0459602{col 26}{space 2} .1322235{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 54}{space 4} -.213193{col 67}{space 3} .3051135
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} -.326102{col 26}{space 2} .1328322{col 37}{space 1}   -2.45{col 46}{space 3}0.014{col 54}{space 4}-.5864482{col 67}{space 3}-.0657557
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 7}2013  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 7}2014  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}  .458467{col 26}{space 2} .1202191{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .2228419{col 67}{space 3} .6940922
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.         outreg2 using lieuLogit, label replace dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"lieuLogit.tex"'"':lieuLogit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "lieuLogit.txt", label"':seeout}

{com}.         margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 51}Number of obs{col 67}= {res}      2121
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(fini), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:2.sexe 0.matu_lieu 20.matu_lieu 29.matu_lieu 33.matu_lieu 2006.debut 2007.debut 2008.debut 2009.debut 2011.debut 2012.debut 2013.debut 2014.debut}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:1.sexe}{space 10}{txt:=} {space 4}.349835 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2.sexe}{space 10}{txt:=} {space 4}.650165 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:0.matu_lieu}{space 5}{txt:=} {space 3}.0603489 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:20.matu_lieu}{space 4}{txt:=} {space 3}.1390853 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:29.matu_lieu}{space 4}{txt:=} {space 3}.0212164 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:33.matu_lieu}{space 4}{txt:=} {space 3}.0193305 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:51.matu_lieu}{space 4}{txt:=} {space 3}.7600189 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2006.debut}{space 6}{txt:=} {space 3}.0504479 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2007.debut}{space 6}{txt:=} {space 3}.1202263 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2008.debut}{space 6}{txt:=} {space 3}.1532296 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2009.debut}{space 6}{txt:=} {space 3}.2206506 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2010.debut}{space 6}{txt:=} {space 3}.2545969 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2011.debut}{space 6}{txt:=} {space 3}.2008487 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0297006{col 26}{space 2} .0208894{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0112419{col 67}{space 3} .0706431
{txt}{space 12} {c |}
{space 3}matu_lieu {c |}
{space 10}0  {c |}{col 14}{res}{space 2}-.1248838{col 26}{space 2} .0442534{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.2116189{col 67}{space 3}-.0381487
{txt}{space 5}France  {c |}{col 14}{res}{space 2}-.0953729{col 26}{space 2}  .029967{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.1541072{col 67}{space 3}-.0366386
{txt}{space 1}Luxembourg  {c |}{col 14}{res}{space 2}-.0224961{col 26}{space 2} .0636308{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-.1472103{col 67}{space 3} .1022181
{txt}{space 6}Maroc  {c |}{col 14}{res}{space 2}-.4734779{col 26}{space 2} .0884313{col 37}{space 1}   -5.35{col 46}{space 3}0.000{col 54}{space 4}   -.6468{col 67}{space 3}-.3001558
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .3728088{col 26}{space 2} .0260389{col 37}{space 1}   14.32{col 46}{space 3}0.000{col 54}{space 4} .3217734{col 67}{space 3} .4238441
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .3714878{col 26}{space 2} .0239818{col 37}{space 1}   15.49{col 46}{space 3}0.000{col 54}{space 4} .3244844{col 67}{space 3} .4184912
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .2259585{col 26}{space 2} .0302216{col 37}{space 1}    7.48{col 46}{space 3}0.000{col 54}{space 4} .1667252{col 67}{space 3} .2851919
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}  .010962{col 26}{space 2} .0315258{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 54}{space 4}-.0508275{col 67}{space 3} .0727515
{txt}{space 7}2011  {c |}{col 14}{res}{space 2}-.0801025{col 26}{space 2} .0325423{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.1438843{col 67}{space 3}-.0163207
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}        .{col 26}{txt}  (not estimable)
{space 7}2013  {c |}{col 14}{res}{space 2}        .{col 26}{txt}  (not estimable)
{space 7}2014  {c |}{col 14}{res}{space 2}        .{col 26}{txt}  (not estimable)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}.         outreg2 using lieuLogit, label append dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"lieuLogit.tex"'"':lieuLogit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "lieuLogit.txt", label"':seeout}

{com}. 
.         global params "i.sexe ib(44).matu_ecole ib(2010).debut" //Auguste (plus mauvais)
{txt}
{com}.         reg moyenne $params , robust 

{txt}Linear regression                                      Number of obs ={res}    2460
                                                       {txt}F( 29,  2430) ={res}   60.27
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.2949
                                                       {txt}Root MSE      = {res} .78587

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                            moyenne{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      t{col 85}   P>|t|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2} .0499272{col 65}{space 2} .0339162{col 76}{space 1}    1.47{col 85}{space 3}0.141{col 93}{space 4}-.0165804{col 106}{space 3} .1164348
{txt}{space 51} {c |}
{space 41}matu_ecole {c |}
{space 49}0  {c |}{col 53}{res}{space 2}-.0470617{col 65}{space 2} .0883219{col 76}{space 1}   -0.53{col 85}{space 3}0.594{col 93}{space 4}-.2202557{col 106}{space 3} .1261324
{txt}{space 39}Autre ecole  {c |}{col 53}{res}{space 2}-.5430538{col 65}{space 2}    .1652{col 76}{space 1}   -3.29{col 85}{space 3}0.001{col 93}{space 4}-.8670012{col 106}{space 3}-.2191065
{txt}{space 28}College Calvin, Geneve  {c |}{col 53}{res}{space 2}-.1056797{col 65}{space 2} .1509802{col 76}{space 1}   -0.70{col 85}{space 3}0.484{col 93}{space 4}-.4017429{col 106}{space 3} .1903835
{txt}{space 16}College de l'Abbaye, Saint-Maurice  {c |}{col 53}{res}{space 2} .2494226{col 65}{space 2} .1343667{col 76}{space 1}    1.86{col 85}{space 3}0.064{col 93}{space 4}-.0140624{col 106}{space 3} .5129077
{txt}{space 24}Ecole des Arches, Lausanne  {c |}{col 53}{res}{space 2}-.5431651{col 65}{space 2} .1755542{col 76}{space 1}   -3.09{col 85}{space 3}0.002{col 93}{space 4}-.8874164{col 106}{space 3}-.1989139
{txt}{space 35}Ecole etrangere  {c |}{col 53}{res}{space 2}-.2074022{col 65}{space 2} .0863402{col 76}{space 1}   -2.40{col 85}{space 3}0.016{col 93}{space 4}-.3767102{col 106}{space 3}-.0380942
{txt}{space 25}Ecole suisse non codifiee  {c |}{col 53}{res}{space 2}-.3515822{col 65}{space 2} .1298555{col 76}{space 1}   -2.71{col 85}{space 3}0.007{col 93}{space 4} -.606221{col 106}{space 3}-.0969433
{txt}{space 16}Gymnase d'Yverdon, Cheseaux-Noreaz  {c |}{col 53}{res}{space 2} .0668496{col 65}{space 2} .1270162{col 76}{space 1}    0.53{col 85}{space 3}0.599{col 93}{space 4}-.1822216{col 106}{space 3} .3159208
{txt}{space 21}Gymnase de Beaulieu, Lausanne  {c |}{col 53}{res}{space 2} .1886116{col 65}{space 2}  .099256{col 76}{space 1}    1.90{col 85}{space 3}0.058{col 93}{space 4}-.0060235{col 106}{space 3} .3832467
{txt}{space 15}Gymnase de Burier, La Tour-de-Peilz  {c |}{col 53}{res}{space 2} .0315074{col 65}{space 2} .1051141{col 76}{space 1}    0.30{col 85}{space 3}0.764{col 93}{space 4}-.1746151{col 106}{space 3}   .23763
{txt}{space 21}Gymnase de Chamblandes, Pully  {c |}{col 53}{res}{space 2} .1098625{col 65}{space 2} .1099479{col 76}{space 1}    1.00{col 85}{space 3}0.318{col 93}{space 4}-.1057387{col 106}{space 3} .3254637
{txt}{space 25}Gymnase de Morges, Morges  {c |}{col 53}{res}{space 2} .1437146{col 65}{space 2} .1048118{col 76}{space 1}    1.37{col 85}{space 3}0.170{col 93}{space 4}-.0618151{col 106}{space 3} .3492442
{txt}{space 29}Gymnase de Nyon, Nyon  {c |}{col 53}{res}{space 2} .1339459{col 65}{space 2} .1015008{col 76}{space 1}    1.32{col 85}{space 3}0.187{col 93}{space 4}-.0650911{col 106}{space 3} .3329829
{txt}{space 23}Gymnase de la Cite Lausanne  {c |}{col 53}{res}{space 2} .0846048{col 65}{space 2}  .116916{col 76}{space 1}    0.72{col 85}{space 3}0.469{col 93}{space 4}-.1446605{col 106}{space 3} .3138702
{txt}{space 23}Gymnase du Bugnon, Lausanne  {c |}{col 53}{res}{space 2} .1317006{col 65}{space 2} .1122836{col 76}{space 1}    1.17{col 85}{space 3}0.241{col 93}{space 4}-.0884808{col 106}{space 3} .3518821
{txt}{space 15}Lycee Denis-de-Rougemont, Neuchtel  {c |}{col 53}{res}{space 2}-.0845976{col 65}{space 2} .1414773{col 76}{space 1}   -0.60{col 85}{space 3}0.550{col 93}{space 4}-.3620262{col 106}{space 3} .1928311
{txt}{space 22}Lycee Jean-Piaget, Neuchtel  {c |}{col 53}{res}{space 2} .1257487{col 65}{space 2} .1784761{col 76}{space 1}    0.70{col 85}{space 3}0.481{col 93}{space 4}-.2242324{col 106}{space 3} .4757298
{txt}Lycee cantonal et Ecole superieure de commerce, Po  {c |}{col 53}{res}{space 2} .0989163{col 65}{space 2} .1690986{col 76}{space 1}    0.58{col 85}{space 3}0.559{col 93}{space 4} -.232676{col 106}{space 3} .4305085
{txt}{space 18}Lycee-College de La Planta, Sion  {c |}{col 53}{res}{space 2} .3518124{col 65}{space 2} .1279045{col 76}{space 1}    2.75{col 85}{space 3}0.006{col 93}{space 4} .1009993{col 106}{space 3} .6026256
{txt}{space 18}Lycee-College des Creusets, Sion  {c |}{col 53}{res}{space 2} .0703252{col 65}{space 2} .1068903{col 76}{space 1}    0.66{col 85}{space 3}0.511{col 93}{space 4}-.1392804{col 106}{space 3} .2799307
{txt}{space 51} {c |}
{space 46}debut {c |}
{space 46}2006  {c |}{col 53}{res}{space 2} .4895017{col 65}{space 2} .0491584{col 76}{space 1}    9.96{col 85}{space 3}0.000{col 93}{space 4} .3931049{col 106}{space 3} .5858985
{txt}{space 46}2007  {c |}{col 53}{res}{space 2}  .636211{col 65}{space 2} .0480193{col 76}{space 1}   13.25{col 85}{space 3}0.000{col 93}{space 4}  .542048{col 106}{space 3} .7303741
{txt}{space 46}2008  {c |}{col 53}{res}{space 2} .5118006{col 65}{space 2} .0498918{col 76}{space 1}   10.26{col 85}{space 3}0.000{col 93}{space 4} .4139656{col 106}{space 3} .6096355
{txt}{space 46}2009  {c |}{col 53}{res}{space 2} .0381411{col 65}{space 2} .0586006{col 76}{space 1}    0.65{col 85}{space 3}0.515{col 93}{space 4}-.0767713{col 106}{space 3} .1530534
{txt}{space 46}2011  {c |}{col 53}{res}{space 2}-.0255591{col 65}{space 2} .0611352{col 76}{space 1}   -0.42{col 85}{space 3}0.676{col 93}{space 4}-.1454415{col 106}{space 3} .0943233
{txt}{space 46}2012  {c |}{col 53}{res}{space 2}-.8345525{col 65}{space 2} .0628121{col 76}{space 1}  -13.29{col 85}{space 3}0.000{col 93}{space 4}-.9577232{col 106}{space 3}-.7113817
{txt}{space 46}2013  {c |}{col 53}{res}{space 2}-1.076203{col 65}{space 2} .0811073{col 76}{space 1}  -13.27{col 85}{space 3}0.000{col 93}{space 4} -1.23525{col 106}{space 3}-.9171568
{txt}{space 46}2014  {c |}{col 53}{res}{space 2}-.8549758{col 65}{space 2} .1717863{col 76}{space 1}   -4.98{col 85}{space 3}0.000{col 93}{space 4}-1.191839{col 106}{space 3}-.5181131
{txt}{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2} 3.937342{col 65}{space 2} .0911065{col 76}{space 1}   43.22{col 85}{space 3}0.000{col 93}{space 4} 3.758688{col 106}{space 3} 4.115997
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using ecole, label replace dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"ecole.tex"'"':ecole.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "ecole.txt", label"':seeout}

{com}.         reg moyenne $params if etat == 3, robust 

{txt}Linear regression                                      Number of obs ={res}    1451
                                                       {txt}F( 26,  1424) ={res}    3.09
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0336
                                                       {txt}Root MSE      = {res} .34724

{txt}{hline 52}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 53}{c |}{col 65}    Robust
{col 1}                                            moyenne{col 53}{c |}      Coef.{col 65}   Std. Err.{col 77}      t{col 85}   P>|t|{col 93}     [95% Con{col 106}f. Interval]
{hline 52}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 47}sexe {c |}
{space 49}M  {c |}{col 53}{res}{space 2} .0090657{col 65}{space 2} .0195923{col 76}{space 1}    0.46{col 85}{space 3}0.644{col 93}{space 4}-.0293671{col 106}{space 3} .0474985
{txt}{space 51} {c |}
{space 41}matu_ecole {c |}
{space 49}0  {c |}{col 53}{res}{space 2} .0027929{col 65}{space 2} .0550885{col 76}{space 1}    0.05{col 85}{space 3}0.960{col 93}{space 4}-.1052705{col 106}{space 3} .1108563
{txt}{space 39}Autre ecole  {c |}{col 53}{res}{space 2}-.0079928{col 65}{space 2} .0942149{col 76}{space 1}   -0.08{col 85}{space 3}0.932{col 93}{space 4}-.1928076{col 106}{space 3} .1768221
{txt}{space 28}College Calvin, Geneve  {c |}{col 53}{res}{space 2}-.0589679{col 65}{space 2} .1071552{col 76}{space 1}   -0.55{col 85}{space 3}0.582{col 93}{space 4}-.2691669{col 106}{space 3} .1512312
{txt}{space 16}College de l'Abbaye, Saint-Maurice  {c |}{col 53}{res}{space 2} .0544612{col 65}{space 2} .0816291{col 76}{space 1}    0.67{col 85}{space 3}0.505{col 93}{space 4} -.105665{col 106}{space 3} .2145874
{txt}{space 24}Ecole des Arches, Lausanne  {c |}{col 53}{res}{space 2}-.2447486{col 65}{space 2} .0878278{col 76}{space 1}   -2.79{col 85}{space 3}0.005{col 93}{space 4}-.4170343{col 106}{space 3}-.0724629
{txt}{space 35}Ecole etrangere  {c |}{col 53}{res}{space 2}-.0185591{col 65}{space 2} .0541344{col 76}{space 1}   -0.34{col 85}{space 3}0.732{col 93}{space 4}-.1247509{col 106}{space 3} .0876327
{txt}{space 25}Ecole suisse non codifiee  {c |}{col 53}{res}{space 2}  -.17983{col 65}{space 2} .0729849{col 76}{space 1}   -2.46{col 85}{space 3}0.014{col 93}{space 4}-.3229995{col 106}{space 3}-.0366606
{txt}{space 16}Gymnase d'Yverdon, Cheseaux-Noreaz  {c |}{col 53}{res}{space 2} .1028354{col 65}{space 2} .0731369{col 76}{space 1}    1.41{col 85}{space 3}0.160{col 93}{space 4}-.0406321{col 106}{space 3}  .246303
{txt}{space 21}Gymnase de Beaulieu, Lausanne  {c |}{col 53}{res}{space 2}-.0200839{col 65}{space 2} .0622975{col 76}{space 1}   -0.32{col 85}{space 3}0.747{col 93}{space 4}-.1422886{col 106}{space 3} .1021209
{txt}{space 15}Gymnase de Burier, La Tour-de-Peilz  {c |}{col 53}{res}{space 2} .0086788{col 65}{space 2} .0634418{col 76}{space 1}    0.14{col 85}{space 3}0.891{col 93}{space 4}-.1157706{col 106}{space 3} .1331282
{txt}{space 21}Gymnase de Chamblandes, Pully  {c |}{col 53}{res}{space 2} .0087655{col 65}{space 2} .0679407{col 76}{space 1}    0.13{col 85}{space 3}0.897{col 93}{space 4}-.1245091{col 106}{space 3} .1420402
{txt}{space 25}Gymnase de Morges, Morges  {c |}{col 53}{res}{space 2} .0495427{col 65}{space 2} .0622321{col 76}{space 1}    0.80{col 85}{space 3}0.426{col 93}{space 4}-.0725338{col 106}{space 3} .1716192
{txt}{space 29}Gymnase de Nyon, Nyon  {c |}{col 53}{res}{space 2} .0122835{col 65}{space 2} .0619647{col 76}{space 1}    0.20{col 85}{space 3}0.843{col 93}{space 4}-.1092684{col 106}{space 3} .1338353
{txt}{space 23}Gymnase de la Cite Lausanne  {c |}{col 53}{res}{space 2} .0269643{col 65}{space 2} .0727406{col 76}{space 1}    0.37{col 85}{space 3}0.711{col 93}{space 4} -.115726{col 106}{space 3} .1696546
{txt}{space 23}Gymnase du Bugnon, Lausanne  {c |}{col 53}{res}{space 2}-.0402771{col 65}{space 2} .0659064{col 76}{space 1}   -0.61{col 85}{space 3}0.541{col 93}{space 4}-.1695612{col 106}{space 3}  .089007
{txt}{space 15}Lycee Denis-de-Rougemont, Neuchtel  {c |}{col 53}{res}{space 2}   .08151{col 65}{space 2} .0790769{col 76}{space 1}    1.03{col 85}{space 3}0.303{col 93}{space 4}-.0736097{col 106}{space 3} .2366297
{txt}{space 22}Lycee Jean-Piaget, Neuchtel  {c |}{col 53}{res}{space 2}-.0035821{col 65}{space 2} .0879317{col 76}{space 1}   -0.04{col 85}{space 3}0.968{col 93}{space 4}-.1760716{col 106}{space 3} .1689074
{txt}Lycee cantonal et Ecole superieure de commerce, Po  {c |}{col 53}{res}{space 2}  .054279{col 65}{space 2} .1117149{col 76}{space 1}    0.49{col 85}{space 3}0.627{col 93}{space 4}-.1648645{col 106}{space 3} .2734225
{txt}{space 18}Lycee-College de La Planta, Sion  {c |}{col 53}{res}{space 2} .1220328{col 65}{space 2} .0984002{col 76}{space 1}    1.24{col 85}{space 3}0.215{col 93}{space 4}-.0709921{col 106}{space 3} .3150577
{txt}{space 18}Lycee-College des Creusets, Sion  {c |}{col 53}{res}{space 2} .0175454{col 65}{space 2} .0683252{col 76}{space 1}    0.26{col 85}{space 3}0.797{col 93}{space 4}-.1164833{col 106}{space 3} .1515742
{txt}{space 51} {c |}
{space 46}debut {c |}
{space 46}2006  {c |}{col 53}{res}{space 2}-.1138514{col 65}{space 2}  .028463{col 76}{space 1}   -4.00{col 85}{space 3}0.000{col 93}{space 4}-.1696852{col 106}{space 3}-.0580176
{txt}{space 46}2007  {c |}{col 53}{res}{space 2} .0163461{col 65}{space 2} .0293236{col 76}{space 1}    0.56{col 85}{space 3}0.577{col 93}{space 4}-.0411761{col 106}{space 3} .0738682
{txt}{space 46}2008  {c |}{col 53}{res}{space 2} .0188412{col 65}{space 2} .0289832{col 76}{space 1}    0.65{col 85}{space 3}0.516{col 93}{space 4}-.0380132{col 106}{space 3} .0756956
{txt}{space 46}2009  {c |}{col 53}{res}{space 2}-.0072542{col 65}{space 2} .0301823{col 76}{space 1}   -0.24{col 85}{space 3}0.810{col 93}{space 4}-.0664607{col 106}{space 3} .0519523
{txt}{space 46}2011  {c |}{col 53}{res}{space 2} .0696869{col 65}{space 2} .0304005{col 76}{space 1}    2.29{col 85}{space 3}0.022{col 93}{space 4} .0100523{col 106}{space 3} .1293214
{txt}{space 51} {c |}
{space 46}_cons {c |}{col 53}{res}{space 2} 4.572436{col 65}{space 2} .0534464{col 76}{space 1}   85.55{col 85}{space 3}0.000{col 93}{space 4} 4.467594{col 106}{space 3} 4.677278
{txt}{hline 52}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using ecole, label append dec(3) tex(frag pr)  drop(ib(2010).debut)
{txt}{stata `"shellout using `"ecole.tex"'"':ecole.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "ecole.txt", label"':seeout}

{com}. 
.         /*
>         global params "i.sexe ib(3).BSc" // management
>         reg moyenne_2 $params , robust 
>         outreg2 using BSc, label replace dec(3) tex(frag pr)
>         reg moyenne_3 $params , robust 
>         outreg2 using BSc, label append dec(3) tex(frag pr)
> 
>         
>         global params "i.sexe ib(11).MSc" //act
>         eststo clear
>         eststo: reg moyenne $params , robust
>         esttab using master.csv, replace wide plain se label
>         */
.         
.         global params "delta_SCI1 delta_MIX1 ib(2011).debut"
{txt}
{com}.         logit fini $params, robust 

{txt}note: 2012.debut != 0 predicts failure perfectly
      2012.debut dropped and 218 obs not used

note: 2013.debut != 0 predicts failure perfectly
      2013.debut dropped and 99 obs not used

note: 2014.debut != 0 predicts failure perfectly
      2014.debut dropped and 13 obs not used

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-1305.2068}  
Iteration 1:{space 3}log pseudolikelihood = {res:-1136.6638}  
Iteration 2:{space 3}log pseudolikelihood = {res:-1119.3969}  
Iteration 3:{space 3}log pseudolikelihood = {res: -1118.729}  
Iteration 4:{space 3}log pseudolikelihood = {res:-1118.7247}  
Iteration 5:{space 3}log pseudolikelihood = {res:-1118.7247}  
{res}
{txt}Logistic regression{col 51}Number of obs{col 67}= {res}      2103
{txt}{col 51}Wald chi2({res}7{txt}){col 67}= {res}    202.82
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log pseudolikelihood = {res}-1118.7247{txt}{col 51}Pseudo R2{col 67}= {res}    0.1429

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        fini{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_SCI1 {c |}{col 14}{res}{space 2} 10.37167{col 26}{space 2} 1.456398{col 37}{space 1}    7.12{col 46}{space 3}0.000{col 54}{space 4} 7.517183{col 67}{space 3} 13.22616
{txt}{space 2}delta_MIX1 {c |}{col 14}{res}{space 2} 3.522222{col 26}{space 2} .4610265{col 37}{space 1}    7.64{col 46}{space 3}0.000{col 54}{space 4} 2.618627{col 67}{space 3} 4.425818
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} 3.604208{col 26}{space 2} .6006826{col 37}{space 1}    6.00{col 46}{space 3}0.000{col 54}{space 4} 2.426892{col 67}{space 3} 4.781525
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}  3.61423{col 26}{space 2} .4025211{col 37}{space 1}    8.98{col 46}{space 3}0.000{col 54}{space 4} 2.825303{col 67}{space 3} 4.403157
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} 1.640457{col 26}{space 2} .1848095{col 37}{space 1}    8.88{col 46}{space 3}0.000{col 54}{space 4} 1.278237{col 67}{space 3} 2.002677
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .4711145{col 26}{space 2} .1405779{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .1955868{col 67}{space 3} .7466421
{txt}{space 7}2010  {c |}{col 14}{res}{space 2} .3571001{col 26}{space 2} .1366003{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} .0893685{col 67}{space 3} .6248317
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 7}2013  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 7}2014  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1016282{col 26}{space 2} .1040069{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-.1022216{col 67}{space 3}  .305478
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.         outreg2 using logit, label replace dec(3) tex(frag pr)
{txt}{stata `"shellout using `"logit.tex"'"':logit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "logit.txt", label"':seeout}

{com}.         global params "delta_OTH1 ib(2011).debut"
{txt}
{com}.         logit fini $params, robust 

{txt}note: 2012.debut != 0 predicts failure perfectly
      2012.debut dropped and 217 obs not used

note: 2013.debut != 0 predicts failure perfectly
      2013.debut dropped and 98 obs not used

note: 2014.debut != 0 predicts failure perfectly
      2014.debut dropped and 13 obs not used

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-1304.0413}  
Iteration 1:{space 3}log pseudolikelihood = {res:-1138.5264}  
Iteration 2:{space 3}log pseudolikelihood = {res:-1122.2932}  
Iteration 3:{space 3}log pseudolikelihood = {res:-1121.6652}  
Iteration 4:{space 3}log pseudolikelihood = {res:-1121.6616}  
Iteration 5:{space 3}log pseudolikelihood = {res:-1121.6616}  
{res}
{txt}Logistic regression{col 51}Number of obs{col 67}= {res}      2102
{txt}{col 51}Wald chi2({res}6{txt}){col 67}= {res}    202.67
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log pseudolikelihood = {res}-1121.6616{txt}{col 51}Pseudo R2{col 67}= {res}    0.1399

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        fini{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-2.377628{col 26}{space 2} .3003347{col 37}{space 1}   -7.92{col 46}{space 3}0.000{col 54}{space 4}-2.966273{col 67}{space 3}-1.788983
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} 3.530274{col 26}{space 2} .5964324{col 37}{space 1}    5.92{col 46}{space 3}0.000{col 54}{space 4} 2.361288{col 67}{space 3}  4.69926
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}  3.53568{col 26}{space 2} .4028609{col 37}{space 1}    8.78{col 46}{space 3}0.000{col 54}{space 4} 2.746088{col 67}{space 3} 4.325273
{txt}{space 7}2008  {c |}{col 14}{res}{space 2}   1.5929{col 26}{space 2} .1816994{col 37}{space 1}    8.77{col 46}{space 3}0.000{col 54}{space 4} 1.236775{col 67}{space 3} 1.949024
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .4539208{col 26}{space 2}  .140387{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4} .1787672{col 67}{space 3} .7290743
{txt}{space 7}2010  {c |}{col 14}{res}{space 2} .3612557{col 26}{space 2} .1363105{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4}  .094092{col 67}{space 3} .6284193
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 7}2013  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 7}2014  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (empty)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .1202664{col 26}{space 2} .1030776{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4} -.081762{col 67}{space 3} .3222948
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.         outreg2 using logit, append  dec(3) tex(frag pr)
{txt}{stata `"shellout using `"logit.tex"'"':logit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "logit.txt""':seeout}

{com}.         margins, dydx(*) atmeans post
{res}
{txt}Conditional marginal effects{col 51}Number of obs{col 67}= {res}      2102
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(fini), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:delta_OTH1 2006.debut 2007.debut 2008.debut 2009.debut 2010.debut 2012.debut 2013.debut 2014.debut}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:delta_OTH1}{space 6}{txt:=} {space 3}.0185255 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2006.debut}{space 6}{txt:=} {space 3}.0509039 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2007.debut}{space 6}{txt:=} {space 3}.1208373 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2008.debut}{space 6}{txt:=} {space 3}.1536632 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2009.debut}{space 6}{txt:=} {space 3}.2216936 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2010.debut}{space 6}{txt:=} {space 3}.2530923 {txt:(mean)}}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:2011.debut}{space 6}{txt:=} {space 3}.1998097 {txt:(mean)}}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}delta_OTH1 {c |}{col 14}{res}{space 2}-.4410258{col 26}{space 2} .0548255{col 37}{space 1}   -8.04{col 46}{space 3}0.000{col 54}{space 4}-.5484817{col 67}{space 3}-.3335699
{txt}{space 12} {c |}
{space 7}debut {c |}
{space 7}2006  {c |}{col 14}{res}{space 2} .4545249{col 26}{space 2} .0297945{col 37}{space 1}   15.26{col 46}{space 3}0.000{col 54}{space 4} .3961289{col 67}{space 3}  .512921
{txt}{space 7}2007  {c |}{col 14}{res}{space 2} .4546637{col 26}{space 2}   .02758{col 37}{space 1}   16.49{col 46}{space 3}0.000{col 54}{space 4} .4006079{col 67}{space 3} .5087194
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .3224127{col 26}{space 2} .0325257{col 37}{space 1}    9.91{col 46}{space 3}0.000{col 54}{space 4} .2586634{col 67}{space 3} .3861619
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} .1104702{col 26}{space 2}  .033998{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0438354{col 67}{space 3}  .177105
{txt}{space 7}2010  {c |}{col 14}{res}{space 2} .0886116{col 26}{space 2} .0333788{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .0231903{col 67}{space 3} .1540328
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}        .{col 26}{txt}  (not estimable)
{space 7}2013  {c |}{col 14}{res}{space 2}        .{col 26}{txt}  (not estimable)
{space 7}2014  {c |}{col 14}{res}{space 2}        .{col 26}{txt}  (not estimable)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}.         outreg2 using logit, label append dec(3) tex(frag pr)
{txt}{stata `"shellout using `"logit.tex"'"':logit.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "logit.txt", label"':seeout}

{com}.         
.         global params "i.sexe"
{txt}
{com}.         
.         **paste
. 
.         reg quant_2 delta6 delta51 delta95 delta121 delta139 delta148 delta170 $params, robust

{txt}Linear regression                                      Number of obs ={res}     951
                                                       {txt}F(  8,   942) ={res}    5.31
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.0417
                                                       {txt}Root MSE      = {res} .15934

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}delta6 {c |}{col 14}{res}{space 2}-.0608748{col 26}{space 2}  .022441{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4} -.104915{col 67}{space 3}-.0168346
{txt}{space 5}delta51 {c |}{col 14}{res}{space 2} .0481727{col 26}{space 2} .0308784{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.0124257{col 67}{space 3} .1087711
{txt}{space 5}delta95 {c |}{col 14}{res}{space 2} .0340596{col 26}{space 2} .0246652{col 37}{space 1}    1.38{col 46}{space 3}0.168{col 54}{space 4}-.0143454{col 67}{space 3} .0824647
{txt}{space 4}delta121 {c |}{col 14}{res}{space 2} .1040031{col 26}{space 2} .0389053{col 37}{space 1}    2.67{col 46}{space 3}0.008{col 54}{space 4} .0276519{col 67}{space 3} .1803542
{txt}{space 4}delta139 {c |}{col 14}{res}{space 2} .0581864{col 26}{space 2} .0371418{col 37}{space 1}    1.57{col 46}{space 3}0.118{col 54}{space 4}-.0147038{col 67}{space 3} .1310766
{txt}{space 4}delta148 {c |}{col 14}{res}{space 2} .1272868{col 26}{space 2} .0310366{col 37}{space 1}    4.10{col 46}{space 3}0.000{col 54}{space 4} .0663779{col 67}{space 3} .1881956
{txt}{space 4}delta170 {c |}{col 14}{res}{space 2} .0559706{col 26}{space 2}  .028816{col 37}{space 1}    1.94{col 46}{space 3}0.052{col 54}{space 4}-.0005804{col 67}{space 3} .1125216
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0052873{col 26}{space 2} .0110136{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-.0163267{col 67}{space 3} .0269013
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6044822{col 26}{space 2} .0091273{col 37}{space 1}   66.23{col 46}{space 3}0.000{col 54}{space 4}   .58657{col 67}{space 3} .6223945
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using coursOld, label replace dec(3) tex(frag pr)
{txt}{stata `"shellout using `"coursOld.tex"'"':coursOld.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "coursOld.txt", label"':seeout}

{com}. 
.         reg quant_3 delta6 delta51 delta95 delta121 delta139 delta148 delta170 $params, robust

{txt}Linear regression                                      Number of obs ={res}     670
                                                       {txt}F(  8,   661) ={res}    1.33
                                                       {txt}Prob > F      = {res} 0.2241
                                                       {txt}R-squared     = {res} 0.0140
                                                       {txt}Root MSE      = {res} .15925

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}delta6 {c |}{col 14}{res}{space 2}-.0047894{col 26}{space 2} .0273623{col 37}{space 1}   -0.18{col 46}{space 3}0.861{col 54}{space 4} -.058517{col 67}{space 3} .0489381
{txt}{space 5}delta51 {c |}{col 14}{res}{space 2} .0367198{col 26}{space 2} .0373789{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-.0366759{col 67}{space 3} .1101155
{txt}{space 5}delta95 {c |}{col 14}{res}{space 2} .0549787{col 26}{space 2} .0307926{col 37}{space 1}    1.79{col 46}{space 3}0.075{col 54}{space 4}-.0054843{col 67}{space 3} .1154418
{txt}{space 4}delta121 {c |}{col 14}{res}{space 2} .0102586{col 26}{space 2} .0474171{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-.0828476{col 67}{space 3} .1033648
{txt}{space 4}delta139 {c |}{col 14}{res}{space 2} .0530371{col 26}{space 2} .0456942{col 37}{space 1}    1.16{col 46}{space 3}0.246{col 54}{space 4}-.0366862{col 67}{space 3} .1427604
{txt}{space 4}delta148 {c |}{col 14}{res}{space 2} .0360185{col 26}{space 2} .0396165{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.0417709{col 67}{space 3} .1138079
{txt}{space 4}delta170 {c |}{col 14}{res}{space 2} .0172404{col 26}{space 2}  .036244{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-.0539268{col 67}{space 3} .0884077
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0258172{col 26}{space 2} .0129036{col 37}{space 1}   -2.00{col 46}{space 3}0.046{col 54}{space 4}-.0511541{col 67}{space 3}-.0004802
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6588689{col 26}{space 2} .0102798{col 37}{space 1}   64.09{col 46}{space 3}0.000{col 54}{space 4} .6386839{col 67}{space 3} .6790538
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         //reg quant_23 delta6 delta51 delta95 delta121 delta139 delta148 delta170 $params, robust
. 
.         /*
>         reg quant_2 delta6 delta25 delta26 delta52 delta55 delta103 delta104 delta122 delta123 delta131 delta171 delta172 $params, robust
>         reg quant_3 delta6 delta25 delta26 delta52 delta55 delta103 delta104 delta122 delta123 delta131 delta171 delta172 $params, robust
>         reg quant_23 delta6 delta25 delta26 delta52 delta55 delta103 delta104 delta122 delta123 delta131 delta171 delta172 $params, robust
>         */
.         reg quant_2 delta6 delta25 delta26 delta52 delta57 delta103 delta104 delta122 delta123 delta133 delta171 delta172 $params, robust

{txt}Linear regression                                      Number of obs ={res}     551
                                                       {txt}F( 13,   537) ={res}    9.81
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1752
                                                       {txt}Root MSE      = {res}  .2211

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}delta6 {c |}{col 14}{res}{space 2}-.0374042{col 26}{space 2} .0470084{col 37}{space 1}   -0.80{col 46}{space 3}0.427{col 54}{space 4}-.1297472{col 67}{space 3} .0549387
{txt}{space 5}delta25 {c |}{col 14}{res}{space 2} -.176328{col 26}{space 2} .0591859{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.2925923{col 67}{space 3}-.0600637
{txt}{space 5}delta26 {c |}{col 14}{res}{space 2} .1219807{col 26}{space 2} .0565021{col 37}{space 1}    2.16{col 46}{space 3}0.031{col 54}{space 4} .0109884{col 67}{space 3}  .232973
{txt}{space 5}delta52 {c |}{col 14}{res}{space 2}-.0987036{col 26}{space 2} .0559054{col 37}{space 1}   -1.77{col 46}{space 3}0.078{col 54}{space 4}-.2085238{col 67}{space 3} .0111165
{txt}{space 5}delta57 {c |}{col 14}{res}{space 2} -.142911{col 26}{space 2} .0628666{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.2664057{col 67}{space 3}-.0194163
{txt}{space 4}delta103 {c |}{col 14}{res}{space 2}-.2087591{col 26}{space 2} .0460601{col 37}{space 1}   -4.53{col 46}{space 3}0.000{col 54}{space 4}-.2992391{col 67}{space 3}-.1182791
{txt}{space 4}delta104 {c |}{col 14}{res}{space 2} .0333207{col 26}{space 2} .0508438{col 37}{space 1}    0.66{col 46}{space 3}0.513{col 54}{space 4}-.0665564{col 67}{space 3} .1331977
{txt}{space 4}delta122 {c |}{col 14}{res}{space 2}-.0506138{col 26}{space 2} .0629758{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-.1743229{col 67}{space 3} .0730953
{txt}{space 4}delta123 {c |}{col 14}{res}{space 2} .0704461{col 26}{space 2} .0668012{col 37}{space 1}    1.05{col 46}{space 3}0.292{col 54}{space 4}-.0607777{col 67}{space 3} .2016699
{txt}{space 4}delta133 {c |}{col 14}{res}{space 2}-.2524922{col 26}{space 2} .0619171{col 37}{space 1}   -4.08{col 46}{space 3}0.000{col 54}{space 4}-.3741215{col 67}{space 3}-.1308628
{txt}{space 4}delta171 {c |}{col 14}{res}{space 2}-.1304654{col 26}{space 2}  .057353{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-.2431291{col 67}{space 3}-.0178016
{txt}{space 4}delta172 {c |}{col 14}{res}{space 2} .0887771{col 26}{space 2} .0601356{col 37}{space 1}    1.48{col 46}{space 3}0.140{col 54}{space 4}-.0293528{col 67}{space 3}  .206907
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2} .0073398{col 26}{space 2}  .020401{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-.0327358{col 67}{space 3} .0474155
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .609578{col 26}{space 2}  .016922{col 37}{space 1}   36.02{col 46}{space 3}0.000{col 54}{space 4} .5763366{col 67}{space 3} .6428194
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         outreg2 using coursNew, label replace dec(3) tex(frag pr)
{txt}{stata `"shellout using `"coursNew.tex"'"':coursNew.tex}
{browse `"/Users/Marco/Google Drive/HEC/empi/proj"' :dir}{com} : {txt}{stata `"seeout using "coursNew.txt", label"':seeout}

{com}.         reg quant_3 delta6 delta25 delta26 delta52 delta57 delta103 delta104 delta122 delta123 delta133 delta171 delta172 $params, robust

{txt}Linear regression                                      Number of obs ={res}     218
                                                       {txt}F( 13,   204) ={res}    3.59
                                                       {txt}Prob > F      = {res} 0.0000
                                                       {txt}R-squared     = {res} 0.1602
                                                       {txt}Root MSE      = {res} .14786

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     quant_3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}delta6 {c |}{col 14}{res}{space 2} .0231009{col 26}{space 2} .0511602{col 37}{space 1}    0.45{col 46}{space 3}0.652{col 54}{space 4}-.0777696{col 67}{space 3} .1239715
{txt}{space 5}delta25 {c |}{col 14}{res}{space 2} -.239767{col 26}{space 2} .0682709{col 37}{space 1}   -3.51{col 46}{space 3}0.001{col 54}{space 4}-.3743742{col 67}{space 3}-.1051599
{txt}{space 5}delta26 {c |}{col 14}{res}{space 2} .0226175{col 26}{space 2} .0556154{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.0870372{col 67}{space 3} .1322722
{txt}{space 5}delta52 {c |}{col 14}{res}{space 2}-.1196651{col 26}{space 2} .0585831{col 37}{space 1}   -2.04{col 46}{space 3}0.042{col 54}{space 4}-.2351711{col 67}{space 3}-.0041591
{txt}{space 5}delta57 {c |}{col 14}{res}{space 2}-.1383273{col 26}{space 2} .0639381{col 37}{space 1}   -2.16{col 46}{space 3}0.032{col 54}{space 4}-.2643916{col 67}{space 3} -.012263
{txt}{space 4}delta103 {c |}{col 14}{res}{space 2}-.0068345{col 26}{space 2} .0480519{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.1015766{col 67}{space 3} .0879076
{txt}{space 4}delta104 {c |}{col 14}{res}{space 2}  .017861{col 26}{space 2}  .049018{col 37}{space 1}    0.36{col 46}{space 3}0.716{col 54}{space 4}-.0787858{col 67}{space 3} .1145078
{txt}{space 4}delta122 {c |}{col 14}{res}{space 2}-.0888046{col 26}{space 2} .0686996{col 37}{space 1}   -1.29{col 46}{space 3}0.198{col 54}{space 4}-.2242569{col 67}{space 3} .0466477
{txt}{space 4}delta123 {c |}{col 14}{res}{space 2}-.0649669{col 26}{space 2}  .067639{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4} -.198328{col 67}{space 3} .0683942
{txt}{space 4}delta133 {c |}{col 14}{res}{space 2}-.1380774{col 26}{space 2} .0621669{col 37}{space 1}   -2.22{col 46}{space 3}0.027{col 54}{space 4}-.2606494{col 67}{space 3}-.0155054
{txt}{space 4}delta171 {c |}{col 14}{res}{space 2}-.0728999{col 26}{space 2} .0614106{col 37}{space 1}   -1.19{col 46}{space 3}0.237{col 54}{space 4}-.1939809{col 67}{space 3}  .048181
{txt}{space 4}delta172 {c |}{col 14}{res}{space 2}-.0486861{col 26}{space 2} .0564049{col 37}{space 1}   -0.86{col 46}{space 3}0.389{col 54}{space 4}-.1598974{col 67}{space 3} .0625252
{txt}{space 12} {c |}
{space 8}sexe {c |}
{space 10}M  {c |}{col 14}{res}{space 2}-.0672647{col 26}{space 2} .0206116{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.1079039{col 67}{space 3}-.0266255
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7182412{col 26}{space 2} .0152093{col 37}{space 1}   47.22{col 46}{space 3}0.000{col 54}{space 4} .6882537{col 67}{space 3} .7482288
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}.         //reg quant_23 delta6 delta25 delta26 delta52 delta57 delta103 delta104 delta122 delta123 delta133 delta171 delta172 $params, robust
. 
.         **end paste
. 
. restore
{txt}
{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/Marco/Google Drive/HEC/empi/proj/log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Jun 2015, 12:40:51
{txt}{.-}
{smcl}
{txt}{sf}{ul off}